import React, { Component } from "react";
import Navbar from "../components/navbar";
import Footer from "../components/footer";
import "../../stylesheets/pages/swotInfoPage.css";

export default class olcInfoPage extends Component {
  constructor(props) {
    super(props);
    // State
    this.state = {};
  }

  // Before render
  componentDidMount = async () => {};

  // Render elements
  render() {
    return (
      <div>
        <Navbar/>
        <div className="linkback">
          <p>
            HOME >{" "}
            <span
              style={{ color: "#f16f20" }}
              onClick={() => {
                document.location.href = "/";
              }}
            >
              OLC
            </span>
          </p>
        </div>
        <div className="whole">
          <div className="swot-infobox">
            <h1>SWOT คืออะไร?</h1>

            <p>
              การวิเคราะห์ SWOT หรือ
              การวิเคราะห์สภาพแวดล้อมและศักยภาพเป็นเครื่องมือในการประเมินสถานการณ์สำหรับการประกอบธุรกิจ
              ซึ่งช่วยให้ผู้บริหารรู้ถึงจุดแข็งและจุดอ่อนจากสภาพแวดล้อมภายใน
              มองเห็นโอกาสและอุปสรรคจากสภาพแวดล้อมภายนอก
              ตลอดจนผลกระทบต่อการประกอบธุรกิจทุกประเภท
            </p>
            <br />
            <p>
              จุดแข็ง (Strengths) :{" "}
              <span style={{ color: "#363C54" }}>
                จุดเด่นหรือจุดแข็ง (ข้อได้เปรียบ) เป็นผลมาจากปัจจัยภายใน
                เป็นข้อดีที่เกิดจากสภาพแวดล้อมภายในบริษัท เช่น
                จุดแข็งด้านการเงิน และข้อได้เปรียบด้านการผลิต
                และด้านทรัพยากรบุคคล
                โดยบริษัทจะต้องใช้ประโยชน์จากจุดแข็งในการกำหนดกลยุทธ์การตลาด
              </span>{" "}
              <br />
              <br />
              จุดอ่อน (Weaknesses) :{" "}
              <span style={{ color: "#363C54" }}>
                จุดด้อยหรือจุดอ่อน ข้อเสียเปรียบเป็นผลมาจากปัจจัยภายใน
                เป็นปัญหาหรือข้อบกพร่องที่เกิดจากสภาพแวดล้อมภายในต่าง ๆ
                ของบริษัท เช่น การขาดเงินทุน นโยบายและทิศทาง
                การบริการที่ไม่แน่นอน หรือบุคลากรที่ไม่มีคุณภาพ
                ซึ่งบริษัทจะต้องหาวิธีในการปรับปรุงให้ดีขึ้นหรือขจัดให้หมดไปอันจะเป็นประโยชน์ต่อบริษัท
              </span>
              <br />
              <br />
              โอกาส (Opportunities) :{" "}
              <span style={{ color: "#363C54" }}>
                เกิดจากปัจจัยภายนอก
                เป็นผลจากการที่สภาพแวดล้อมภายนอกของบริษัทเอื้อประโยชน์
                หรือส่งเสริมการดำเนินงานของบริษัท
                โอกาสแตกต่างจากจุดแข็งตรงที่โอกาสเป็นผลมาจากสภาพแวดล้อมภายนอก
                แต่จุดแข็งเป็นผลมาจากสภาพแวดล้อมภายใน
                ผู้ประกอบการที่ดีจะต้องแสวงหาโอกาสอยู่เสมอ
                โดยการวิเคราะห์สิ่งแวดล้อมภายนอกที่เปลี่ยนแปลงอยู่เสมอ ตลอดเวลา
                เช่น เศรษฐกิจ สังคม การเมือง เทคโนโลยีและการแข่งขันในตลาด
                และใช้ประโยชน์จากโอกาสนั้น
              </span>
              <br />
              <br />
              อุปสรรค (Threats) :
              <span style={{ color: "#363C54" }}>
                {" "}
                เกิดจากปัจจัยภายนอก
                เป็นข้อจำกัดที่เกิดจากสภาพแวดล้อมภายนอกที่ส่งผลเสียต่อธุรกิจ
                เช่น ราคาน้ำมันที่สูงขึ้น อัตราดอกเบี้ยที่สูงขึ้น
                สภาพเศรษฐกิจที่ชะลอตัว
                ผู้ประกอบการจำเป็นต้องปรับกลยุทธ์ทางการตลาดให้สอดคล้อง
                และพยายามขจัดอุปสรรคต่าง ๆ ที่เกิดขึ้นให้ได้{" "}
              </span>
            </p>
            <button
              className="button"
              onClick={() => (window.location = "/olc-analysis")}
            >
              <span>เริ่มการวิเคราะห์</span>
            </button>
          </div>
        </div>
        <Footer className="footer" />
      </div>
    );
  }
}
