import React, { Component } from "react";
import Navbar from "../components/navbar";
import Footer from "../components/footer";
import "../../stylesheets/pages/swotInfoPage.css";
import { withRouter } from "react-router-dom";

class olcInfoPage extends Component {
  constructor(props) {
    super(props);
    // State
    this.state = {
      btnActive: 3,
      expandedText: false,
    };
  }

  // Before render
  componentDidMount = async () => {
    localStorage.clear();
    localStorage.setItem("swotolcBoolean", false);
  };

  expandedText = async () => {
    await this.setState({ expandedText: true });
  };

  // Render elements
  render() {
    let { btnActive } = this.state;
    return (
      <div>
        <Navbar swot={btnActive} />
        <div className="linkback">
          <p
            onClick={() => {
              this.props.history.push("/");
              window.scrollTo(0, 0);
            }}
          >
            {" "}
            HOME > <span style={{ color: "#f16f20" }}>OLC</span>
          </p>
        </div>
        <div className="whole">
          <div className="swot-infobox">
            <h1>OLC คืออะไร?</h1>
            <p>
              OLC (Organization life cycle) หรือวงจรชีวิตขององค์กร คือ
              เครื่องมือหรือสิ่งที่ใช้ในการวิเคราะห์ธุรกิจหรือกิจการว่าองค์กรหรือกระบวนต่างๆ
              ไม่ว่าจะเป็นการทำงานหรือการบริหารงานในกิจการของคุณนั้นอยู่ในช่วงใด
              เมื่อทราบว่าอยู่ในช่วงใดนั้น คุณจะสามารถหาวิธีรับมือ
              วิธีการแก้ไขปัญหาหรือแนวทางในการดำเนินกิจการสืบต่อไป ซึ่ง OLC
              มีทั้งหมด 5 ขั้นได้แก่
            </p>
            <br />
            <p>
              1. ระยะก่อตั้ง (Birth) / ขั้นแนะนำ (Introduction) :{" "}
              <span style={{ color: "#363C54" }}>
                เป็นช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น
                โดยองค์กรอาจจะยังไม่ใหญ่โตมาก
                การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้
                ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน
                ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ
                ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น
                และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย
                ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด
                เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้
              </span>{" "}
              <a
                style={{
                  color: "#f16f20",
                  display: this.state.expandedText ? "none" : "inline",
                }}
                onClick={this.expandedText}
                className="links"
              >
                อ่านเพิ่มเติม...
              </a>
              {this.state.expandedText && (
                <div>
                  <br />
                  2. ระยะเติบโต (Growth) :{" "}
                  <span style={{ color: "#363C54" }}>
                    องค์กรเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้
                    มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า
                    มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด
                    ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก
                    รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น
                    ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร
                    มีลำดับขั้นของสายบังคับบัญชา นโยบาย
                    แผนการทำงานและวิสัยทัศน์ที่ชัดเจน
                    ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า
                    โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น
                    หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้
                  </span>
                  <br />
                  <br />
                  3. ระยะวุฒิภาวะ / ระยะเติบโตเต็มที่ (Maturity) :{" "}
                  <span style={{ color: "#363C54" }}>
                    ระยะนี้ถ้าเทียบกับอายุคนจะถือว่าอยู่ในวัยผู้ใหญ่
                    เพราะเป็นช่วงที่องค์การเติบโตเต็มที่หรือมีอัตราการเจริญเติบโตช้าลง
                    แต่สามารถแบ่งส่วนครองตลาดได้มากกว่าระยะอื่นๆ
                    ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้าหรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง
                    ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม
                    อาจทำให้กำไรของธุรกิจลดลง
                    ถ้าหากไม่มีการพัฒนาอาจจะทำให้องค์กรมีโอกาสตายได้
                    ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ
                    มีการพัฒนาอยู่ตลอดเวลา
                    โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์ เช่น
                    ช้างมีการแจกผ้าห่มหรือเป็นสปอนเซอร์ให้กับนักฟุตบอล
                    เพื่อรักษาภาพลักษณ์ที่ดีและกลุ่มลูกค้า เป็นต้น
                  </span>
                  <br />
                  <br />
                  4. ระยะเสื่อมถอย / ระยะตกต่ำ (Decline) :
                  <span style={{ color: "#363C54" }}>
                    {" "}
                    เป็นระยะที่องค์การหรือธุรกิจกำลังประสบปัญหาต่างๆ เช่น
                    พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง
                    พนักงานปฏิบัติตามคำสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์เป็นของตนเอง
                    สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน
                    วิธีการแก้ไขปัญหาก็คือ ต้องใช้กลยุทธ์หรือแรงจูงใจในการทำงาน
                    เช่น จัดกิจกรรมพิเศษ เพิ่มโบนัส เพิ่มเงินเดือน เป็นต้น{" "}
                  </span>
                  <br />
                  <br />
                  5. การยุบองค์กร / การสิ้นสุดสภาพขององค์กร (Death) :
                  <span style={{ color: "#363C54" }}>
                    {" "}
                    เมื่อมีการเสื่อมถอยขององค์การมากขึ้น คือ ยอดขายลดลงเรื่อยๆ
                    คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่างๆได้
                    ซึ่งอาจสังเกตได้จาก กิจการไม่มีกำไร ขาดทุน
                    ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง
                    ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม
                    แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้
                    ในช่วงนี้กิจการสามารถดำเนินต่อไปได้
                    แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก
                    เหมือนเป็นการเริ่มต้นกิจการใหม่ ในการทำธุรกิจนั้น
                    กิจการไม่ควรปล่อยให้ธุรกิจของตนเองดำเนินมาจนถึงขั้นที่ 5 นี้
                    เพราะมีโอกาสที่จะปิดกิจการสูงมาก น้อยที่จะกลับไปเริ่มต้นใหม่
                    ส่วนใหญ่ผู้ประกอบการหรือผู้ที่ทำธุรกิจจะไม่ปล่อยให้ธุรกิจของตนเองก้าวไปถึงขั้นที่
                    3 เมื่ออยู่ขั้นที่ 2 ก็จะทำการพัฒนาเพื่อไม่ให้ธุรกิจถดถอย{" "}
                  </span>
                </div>
              )}
              <br />
              <br />
              คู่มือการทำ Organization Life Cycle (OLC)
              <br />
              <br />
              <span style={{ color: "#363C54" }}>
                1. ให้ผู้ใช้งานเลือกคำตอบที่ตรงกับธุรกิจตนเองมากที่สุดไม่เกิน 10
                ตัวเลือก <br />
                <br />
                2. เมื่อทำการเลือกเสร็จสิ้น
                ระบบจะทำการประมวลผลว่าธุรกิจหรือกิจการของคุณนั้นอยู่ในช่วงใดของวงจรชีวิตธุรกิจ
                (OLC)
                <br />
                <br /> 3. ในกรณีที่ทำแบบทดสอบเสร็จสิ้นแล้วไม่ปรากฏคำตอบ
                หากแต่แสดงหน้าเว็บไซต์ที่เป็นแบบสอบถามอีกครั้ง
                ให้ท่านทำการให้คะแนนตัวเลือกทั้งหมด 5 ข้อ
                โดยต้องให้คะแนนในแต่ละข้อไม่ซ้ำกันและท่านสามารถให้คะแนนได้ตั้งแต่
                1-5 คะแนน เมื่อทำการให้คะแนนเสร็จสิ้นให้กดประเมินผลอีกครั้ง
                <br />
                <br />
              </span>
              **หมายเหตุ
              <br />- ผลการประเมินที่ได้อาจเป็นข้อมูลเพียงเบื้องต้นเท่านั้น
              <br />- ตัวเลือกที่ใช้ในการทำแบบทดสอบนั้นอยู่ในช่วงระยะเวลา
              <br />
              ปัจจุบัน (เดือนพฤษภาคม พ.ศ.2563)
            </p>
            <button
              className="button"
              onClick={() => {
                this.props.history.push("/olc-analysis");
                window.scrollTo(0, 0);
              }}
            >
              <span>เริ่มการวิเคราะห์</span>
            </button>
          </div>
        </div>
        <Footer className="footer" />
      </div>
    );
  }
}

export default withRouter(olcInfoPage);
