import React, { Component } from "react";
import Navbar from "../components/navbar";
import Strength from "../components/strength";
import "../../stylesheets/pages/swotPage.css";
import { Bubble, Line } from "react-chartjs-2";
import Footer from "../components/footer";

const options = {
  tooltips: {
    enabled: false,
  },
  ticks: {
    display: false,
    fontColor: "#fff",
  },
  layout: {
    padding: {
      left: 10,
      right: 10,
      top: 10,
      bottom: 10,
    },
  },
  legend: {
    display: false,
  },
  title: {
    display: false,
    text: "SWOT Result",
    fontFamily: "light",
    fontSize: 28,
    padding: 26,
    fontColor: "#363C54",
  },
  scales: {
    yAxes: [
      {
        ticks: {
          beginAtZero: true,
          max: 10,
          min: -10,
          fontColor: "#363C54",
          fontSize: 16,
        },
        gridLines: {
          color: "rgba(0, 0, 0, 0.1)",
          zeroLineColor: "rgba(0, 0, 0, 1.0)",
        },
      },
    ],
    xAxes: [
      {
        ticks: {
          beginAtZero: true,
          max: 10,
          min: -10,
          fontColor: "#363C54",
          padding: 10,
          fontSize: 16,
        },
        gridLines: {
          color: "rgba(0, 0, 0, 0.1)",
          zeroLineColor: "rgba(0, 0, 0, 1.0)",
        },
      },
    ],
  },
};

export default class resultPage extends Component {
  constructor(props) {
    super(props);
    // State
    this.state = {
      btnActive: 4,
      data: {
        datasets: [
          {
            backgroundColor: "rgb(241, 111, 32,0.6)",
            borderColor: "rgb(241, 111, 32,1)",
            pointStyle: "circle",
            rotation: 45,
            borderWidth: 10,
            hoverRadius: 10,
            data: [],
          },
        ],
      },
      mode: "",
      result1SO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น เช่น การคำนึงถึงความต้องการของลูกค้า มองหาช่องทางจัดจำหน่ายที่แน่นอนโดยการทำสัญญากับบริษัทตัวแทนจำหน่าย มองหาแหล่งซัพพลายเออร์ที่จะช่วยให้ธุรกิจมีต้นทุนการผลิตต่ำลง แต่ต้องเป็นแหล่งที่ได้มาซึ่งวัตถุดิบที่มีคุณภาพ คุณภาพของสินค้าที่ผลิตออกมาต้องมีคุณภาพและเป็นที่ยอมรับ เพื่อเป็นการสร้างความน่าเชื่อถือให้กับแบรนด์ ผลิตภัณฑ์ที่ผลิตต้องมีความเป็นเอกลักษณ์และมีมาตรฐาน สร้างความเชื่อมันให้กับพนักงานเพื่อให้เขาเหล่านั้นเกิดความจงรักภักดีต่อองค์กร เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ ๆ ออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ สำรวจตลาดว่าในปัจจุบันผู้บริโภคมีความต้องการหรือมีค่านิยมอย่างไร เพื่อที่จะนำมาปรับใช้กิจการโดยการออกผลิตภัณฑ์ใหม่ ๆ ที่ตรงกับความต้องการของลูกค้า และช่วงนี้สังคมหรือสภาพแวดล้อมประสบปัญหาอะไร เพราะการที่เราสามารถผลิตสินค้าหรือผลิตภัณฑ์ที่สามารถแก้ไขปัญหาให้กับผู้คนได้ จะยิ่งทำให้เรามีกำไรและยอดขายเพิ่มมากขึ้น การกระทำเช่นนี้ก็ถือเป็นการขยายฐานลูกค้าเพราะทำให้เราสามรถเข้าถึงกลุ่มลูกค้ากลุ่มใหม่ได้ง่ายมากขึ้น ยกตัวอย่างเช่น หากท่านทำธุรกิจผลิตหน้ากากอนามัย ในการผลิตหน้ากากอนามัยนั้นอาจจะมีการผลิตหลายรุ่นหลายรูปแบบ แต่ด้วยสภาพสังคมปัจจุบันมีการแพร่ระบาดของเชื้อไวรัสและค่าฝุ่นที่สูงขึ้น ดังนั้นควรจะมุ่งเน้นการผลิตไปยังรุ่นที่สามารถตอบโจทย์ลูกค้าหรือสามารถป้องกันปัญหานี้ได้ ไม่ว่าจะเป็นหน้ากากที่สามารถกันฝุ่น PM 2.5 ได้หรือหน้ากากที่สามารถกรองเชื้อโรคได้ มากกว่ารุ่นที่บางและกันฝุ่นได้น้อย อีกหนึ่งธุรกิจที่ทางเราขอยกตัวอย่างคือ การผลิตเครื่องดื่ม ในสภาพสังคมปัจจุบันผู้คนได้หันมาสนใจในเรื่องของการดูแลสุขภาพมากขึ้น เครื่องดื่มที่ผลิตออกไปควรเป็นเครื่องดื่มที่ใส่ใจต่อสุขภาพของผู้บริโภค มากกว่าเครื่องดื่มที่ให้ความสดชื่นหรือให้ความหวานเพียงอย่างเดียว และควรมีบรรจุภัณฑ์ที่สวยงาม สามารถดึงดูดลูกค้าได้ ซึ่งการออกผลิตภัณฑ์ใหม่ควรทำการตลาดและประชาสัมพันธ์เพื่อให้ผลิตภัณฑ์เป็นที่รู้จัก เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่าเป็นช่วงที่องค์การเติบโตเต็มที่หรือมีอัตราการ เจริญเติบโตช้าลง แต่สามารถแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้า หรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของโอกาสใหม่ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์  ซึ่งธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น การขยายขนาดของธุรกิจ ขยายขนาดโรงงานหรือเพิ่มเครื่องจักรเพื่อเพิ่มกำลังการผลิตให้เหมาะสมกับความต้องการของลูกค้า การหาซัพพลายเออร์รายใหม่เพื่อต่อรองราคาของวัตถุดิบได้ถูกลง เป็นการลดต้นทุนการผลิตได้ เช่น หากท่านเป็นเจ้าของกิจการโรงงานผลิตหน้ากากอนามัย ท่านสามารถเพิ่มกำลังการผลิตได้อย่างเต็มกำลัง หรือลงทุนเพิ่มเครื่องจักรภายในโรงงาน เพื่อตอบสนองความต้องการของลูกค้าที่มีมากในปัจจุบัน",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกาลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคาสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน วิธีการแก้ไขปัญหาก็คือ ต้องใช้กลยุทธ์หรือ แรงจูงใจในการทางาน เช่น จัดกิจกรรมพิเศษ เพิ่มโบนัส เพิ่มเงินเดือน  แต่ธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น จึงเป็นโอกาสที่ดีที่ท่านสามารถแก้ไขปัญหาและพัฒนาธุรกิจของท่านให้ผ่านระยะปัญหานี้ได้ คือการใช้โอกาสที่เกิดขึ้นขณะนั้น มาใช้พัฒนาควบคู่กับจุดแข็งของธุรกิจของท่าน เช่น จากสถานการณ์โควิด-19 ทำให้หน้ากากอนามัยขาดตลาด หากท่านเป็นโรงงานผลิตหน้ากากอนามัย ท่านจะได้รับโอกาสจากเหตุการณ์นี้คือ จะได้รับยอดสั่งผลิตเป็นจำนวนมาก ทำให้ได้รับรายได้จากโอกาสนี้จนสามารถพัฒนาธุรกิจของท่านให้สามารถผ่านพ้นปัญหาที่ประสบและกลับไปสู่ระยะของธุรกิจที่ดีขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ถดถอยขององค์การมากขึ้นคือ ยอดขายลดลงเรื่อย ๆ คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่าง ๆ ได้ ซึ่งอาจสังเกตุได้จาก กิจการไม่มีกำไร ขาดทุน ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้ ในช่วงนี้กิจการสามารถดำเนินต่อไปได้ แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก เหมือนเป็นการเริ่มต้นกิจการใหม่ คำแนะนำคือ  การคำนึงถึงความต้องการของลูกค้า มองหาช่องทางจัดจำหน่ายที่แน่นอนโดยการทำสัญญากับบริษัท ตัวแทนจาหน่าย หาแหล่งซัพพลายเออร์ที่จะช่วยให้ธุรกิจมีต้นทุนการผลิตต่ำลง แต่ต้องเป็นแหล่งที่ได้มาซึ่ง วัตถุดิบที่มีคุณภาพ คุณภาพของสินค้าที่ผลิตออกมาต้องมีคุณภาพและเป็นที่ยอมรับ เพื่อเป็นการสร้างความ น่าเชื่อถือให้กับแบรนด์ หรือจะทำการเปลี่ยนแปลตัวผลิตภัณฑ์ใหม่ เพื่อให้ดูแปลกใหม่ เพราะ เดิมลูกค้าจะเน้นจำตัวผลิตภัณฑ์เดิม ๆ เป็นต้น",
      ],
      result2SO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น เช่น การอำนวยความสะดวกให้แก่ลูกค้าในเรื่องของที่จอดรถ พนักงานมีการดูแลเอาใจใส่ลูกค้าก่อนการให้บริการ ในการให้บริการต้องสามารถตอบสนองความต้องการของลูกค้าได้ ในบริเวณสถานที่ที่ให้บริการควรมีการตกแต่งให้เข้ากับบรรยากาศภายในร้านและควรตกแต่งให้มีความเป็นเอกลักษณ์ เพื่อสร้างความประทับใจให้กับลูกค้า มีสื่อโซเชียลมีเดียไว้ใช้ติดต่อสื่อสารกับลูกค้า เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ยกตัวอย่างเช่น ร้านอินเตอร์เน็ตอาจจะมีสินค้าหรือบริการให้กับลูกค้าที่มาใช้บริการ ไม่ว่าจะเป็นในเรื่องของอาหาร เครื่องดื่มที่ลูกค้าสามารถกดสั่งในคอมพิวเตอร์ แล้วผู้ให้บริการจึงนำสิ่งที่ลูกค้ากดสั่งไปส่งถึงที่ เป็นต้น ในการให้บริการนี้ผู้ประกอบการควรมีการสอบถามถึงความพึงพอใจหรือข้อเสนอแนะที่ลูกค้าคิดเห็นต่อบริการนั้น ๆ  นอกจากนี้ยังมีอีกหลายธุรกิจที่ควรจะปรับตัวหรือมีบริการใหม่ๆที่สามารถตอบสนองความต้องการของผู้บริโภคได้อย่างทันท่วงที เช่น ร้านเสริมสวยที่มีการพัฒนาฝีมืออยู่ตลอดเวลา หรืออัพเกรดเทรนด์ แฟชั่นของการเสริมสวยที่มีการเปลี่ยนแปลงไปตามยุคสมัยและค่านิยมของผู้บริโภค เพื่อให้เข้าถึงความต้องการของลูกค้าให้ได้มากที่สุด เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่าเป็นช่วงที่องค์การเติบโตเต็มที่หรือมีอัตราการ เจริญเติบโตช้าลง แต่สามารถแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้า หรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของธุรกิจลดลง ถ้าหากไม่มีการพัฒนาอาจจะทาให้องค์กรมีโอกาสตายได้ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์  ซึ่งธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น การขยายขนาดของธุรกิจ การทำการประชาสัมพันธ์อย่างต่อเนื่อง การเพิ่มกิจกรรมภายในกิจการเพื่อตอบสนองความต้องการของลูกค้ามากขึ้นและสามารถดึงดูดลูกค้าใหม่อีกด้วย เช่น ในสถานการณ์ปัจจุบันที่ประสบปัญหาไวรัสโควิด-19หากท่านมีกิจการโรงพยาบาล ท่านสามารถลงทุนเพิ่มขนาดของโรงพยาบาลของท่าน เพื่อตอบสนองความต้องการลูกค้า หรือสถานการณ์มลพิษทางอากาศ และอุณหภูมิที่พุ่งสูง หากท่านประกอบกิจการร้านอาหาร ท่านสามารถลงทุนติดตั้งเครื่องปรับอากาศเพื่อดึงดูดลูกค้าให้มาใช้บริการ เนื่องจากลูกค้าจำนวนมากต้องการร้านอาหารที่มีบรรยากาศเหมาะสมกับสภาพแวดล้อมในขณะนั้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกาลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคาสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน วิธีการแก้ไขปัญหาก็คือ ต้องใช้กลยุทธ์หรือ แรงจูงใจในการทางาน เช่น จัดกิจกรรมพิเศษ เพิ่มโบนัส เพิ่มเงินเดือน  แต่ธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น จึงเป็นโอกาสที่ดีที่ท่านสามารถแก้ไขปัญหาและพัฒนาธุรกิจของท่านให้ผ่านระยะปัญหานี้ได้ คือการใช้โอกาสที่เกิดขึ้นขณะนั้น มาใช้พัฒนาควบคู่กับจุดแข็งของธุรกิจของท่าน เช่น จากสถานการณ์ปัญหาทางมลพิษ pm2.5 และอุณหภูมิที่พุ่งสูงเกือบ 40 องศา ทำให้ประชาชนทั่วไปนิยมใช้บริการสถานที่ที่มีเครื่องปรับอากาศ หากสถานประกอบการของท่านมีเครื่องปรับอากาศภายในอาคาร จะสามารถดึงดูดลูกค้าให้มาใช้บริการได้มากขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ถดถอยขององค์การมากขึ้นคือ ยอดขายลดลงเรื่อย ๆ คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่าง ๆ ได้ ซึ่งอาจสังเกตุได้จาก กิจการไม่มีกำไร ขาดทุน ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้ ในช่วงนี้กิจการสามารถดำเนินต่อไปได้ แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก เหมือนเป็นการเริ่มต้นกิจการใหม่ คำแนะนำคือ เพิ่มสิ่งอำนวยความสะดวกใหม่ๆให้แก่ลูกค้าในเรื่องของ ที่จอดรถหรือ พนักงานมีการดูแลเอาใจใส่ลูกค้าก่อนการ ให้บริการ ในการให้บริการต้องสามารถตอบสนองความต้องการของลูกค้าได้ ในบริเวณสถานที่ที่ให้บริการควรมี การตกแต่งให้เข้ากับบรรยากาศภายในร้านและควรตกแต่งให้มีความเป็นเอกลักษณ์ เพื่อสร้างความประทับใจ ให้กับลูกค้า หรือ เพิ่มการบริการในแบบปัจจุบันนี้คือ การบริการลูกค้าถึงที่ แบบ Grab food และ มีสื่อออนไลน์ไว้ใช้ติดต่อสื่อสารกับลูกค้า",
      ],
      result3SO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น เช่น การทำการตลาด การประชาสัมพันธ์ให้กับสินค้าหรือผลิตภัณฑ์ เอาใจใส่ในความต้องการของผู้บริโภค สามารถตอบสนองต่อความต้องการของผู้บริโภคได้ หากเป็นร้านขายของชำหรือมินิมาร์ท ควรจัดวางสินค้าให้เป็นหมวดหมู่ เพื่อให้ลูกค้าสามารถหยิบจับสินค้าได้ง่าย ผู้ประกอบการหรือพนักงานควรมีความรู้ในสิ่งที่กิจการกำลังกระทำขณะนั้น ไม่ว่าจะเป็นในเรื่องของข้อมูลสินค้าและผลิตภัณฑ์ต่าง ๆ คำแนะนำ เพื่อให้ง่ายต่อการตัดสินใจของลูกค้าเมื่อลูกค้าต้องการข้อมูล มีสื่อโซเชียลมีเดียไว้ใช้ติดต่อสื่อสารกับลูกค้าเป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ยกตัวอย่างเช่น การทำธุรกิจโดยคำนึงถึงสิ่งแวดล้อม โดยการนำผลิตภัณฑ์ที่เป็นมิตรกับสิ่งแวดล้อมมาจำหน่าย สิ่งนี้จะช่วยยกระดับภาพลักษณ์ของกิจการหรือแบรนด์ให้ดียิ่งขึ้น และยังเป็นการขยายฐานลูกค้าไปยังกลุ่มที่นิยมซื้อผลิตภัณฑ์ที่เป็นมิตรกับสิ่งแวดล้อม รวมไปถึงการจ้างพนักงาน ซึ่งในการจ้างพนักงานนี้ควรที่จะจัดหน้าที่งานให้ตรงกับความสามารถหรือความถนัดของแต่ละบุคคล เพื่อให้กิจการสามารถดำเนินไปได้อย่างราบรื่น หากจัดสรรงานไม่เข้ากับความสามารถของแต่ละบุคคล อาจทำให้การดำเนินการในขั้นตอนต่าง ๆ ติดขัดหรือเกิดความล่าช้าได้ เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่าเป็นช่วงที่องค์การเติบโตเต็มที่หรือมีอัตราการ เจริญเติบโตช้าลง แต่สามารถแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้า หรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของธุรกิจลดลง ถ้าหากไม่มีการพัฒนาอาจจะทาให้องค์กรมีโอกาสตายได้ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์  ซึ่งธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น คือ การเลือกจัดจำหน่ายผลิตภัณฑ์ใหม่ออกมา หรือการลงทุนขยายธุรกิจ การทำการตลาดเพื่อขยายฐานลูกค้า และการจัดทำโปรโมชั่นเพื่อดึงดูดลูกค้าใหม่และรักษาภาพลักษณ์ที่ดีและกลุ่มลูกค้า เช่น ช้างมีการแจกผ้าห่ม หรือเป็นสปอนเซอร์ให้กับนักฟุตบอล การรับสินค้าที่เป็นที่ต้องการของลูกค้าในปัจจุบันมาจำหน่าย เช่น หน้ากากอนามัย เครื่องกรองอากาศ เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกาลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคาสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน วิธีการแก้ไขปัญหาก็คือ ต้องใช้กลยุทธ์หรือ แรงจูงใจในการทางาน เช่น จัดกิจกรรมพิเศษ เพิ่มโบนัส เพิ่มเงินเดือน  แต่ธุรกิจของท่านนั้น มีจุดแข็งและโอกาสที่จะช่วยให้ธุรกิจของท่านประสบความสำเร็จมากยิ่งขึ้น จึงเป็นโอกาสที่ดีที่ท่านสามารถแก้ไขปัญหาและพัฒนาธุรกิจของท่านให้ผ่านระยะปัญหานี้ได้ คือการใช้โอกาสที่เกิดขึ้นขณะนั้น มาใช้พัฒนาควบคู่กับจุดแข็งของธุรกิจของท่าน เช่น ในสถานการณ์ปัจจุบันประเทศไทยประสบปัญหาไวรัสโควิด-19 ทำให้มีการซื้อขายหน้ากากอนามัยเป็นจำนวนมาก จนประสบปัญหาขาดตลาด หากท่านเป็นเจ้าของกิจการร้านขายยา หรือร้านขายอุปกรณ์ทางการแพทย์และมีหน้ากากอนามัยอยู่ในคลังสินค้า เป็นโอกาสให้ท่านสามารถนำมาจัดจำหน่ายได้ในราคาที่ได้กำไรจากเดิมหลายเท่าตัว ทำให้กิจการของท่านมีรายได้และกำไรเพิ่มขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ถดถอยขององค์การมากขึ้นคือ ยอดขายลดลงเรื่อย ๆ คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่าง ๆ ได้ ซึ่งอาจสังเกตุได้จาก กิจการไม่มีกำไร ขาดทุน ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้ ในช่วงนี้กิจการสามารถดำเนินต่อไปได้ แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก เหมือนเป็นการเริ่มต้นกิจการใหม่ คำแนะนำคือ การทำการตลาดใหม่ การประชาสัมพันธ์ให้กับสินค้าหรือผลิตภัณฑ์ใหม่ เอาใจใส่ในความต้องการของผู้บริโภค ว่าในปัจจุบันผู้บริโภคต้องการอะไรแบบไหน หรือ อาจจะเพิ่มการบริการแบบ Drive-thru เพื่ออำนวยความสะดวกให้กับลูกค้ามากขึ้น หากเป็นร้านขายของชาหรือมินิมาร์ท ควรจัดสินค้าให้อยู่ในชั้นวางที่เท่ากับระดับสายตา เพื่อให้สะดุดตาและง่ายต่อการหยิบจับ และ ควรจะมีการโปรโมตผ่านสื่อออนไลน์ เพราะในปัจจุบันนี้ ผู้คนใช้สื่อออนไลน์และรับรู้ข่าวสารผ่านทางด้านนี้มากที่สุด",
      ],
      result1ST: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือ ธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทางานในองค์กรนั้นต้องสามารถผลัดเปลี่ยน หรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วง ที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่ง สามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้โดยการมีคู่แข่งขันตลาดในประเภทเดียวกันมีจำนวนที่เพิ่มขึ้น สินค้าสามารถลอกเลียนแบบได้ง่าย หรือพฤติกรรมของลูกค้าเปลี่ยนแปลงไป ดังนั้นแนะนำให้ท่านกำหนดกลยุทธ์เพื่อรับมือกับอุปสรรคที่อาจเกิดขึ้นได้ โดยใช้จุดแข็งที่ท่านมี นำมาพัฒนาธุรกิจการผลิตของท่าน สร้างความแตกต่าง คำนึงถึงประสิทธิภาพในการผลิต จดสิทธิบัตรเพื่อป้องกันการลอกเลียนแบบของผลิตภัณฑ์ของท่าน และสำรวจความต้องการของลูกค้าอย่างต่อเนื่อง",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้โดยการมีคู่แข่งขันตลาดในประเภทเดียวกันมีจำนวนที่เพิ่มขึ้น สินค้าสามารถลอกเลียนแบบได้ง่าย หรือพฤติกรรมของลูกค้าเปลี่ยนแปลงไป ดังนั้นแนะนำให้ท่านกำหนดกลยุทธ์เพื่อรับมือกับอุปสรรคที่อาจเกิดขึ้นได้ โดยใช้จุดแข็งที่ท่านมี นำมาพัฒนาธุรกิจการผลิตของท่าน สร้างความแตกต่าง คำนึงถึงประสิทธิภาพในการผลิต จดสิทธิบัตรเพื่อป้องกันการลอกเลียนแบบของผลิตภัณฑ์ของท่าน สำรวจความต้องการของลูกค้าอย่างต่อเนื่อง และรักษาระดับคุณภาพของการผลิตของท่านเพื่อป้องกันความเสียหายในอนาคต เน้นประชาสัมพันธ์และทำการตลาด เพื่อขยายฐานลูกค้าให้กว้างมากยิ่งขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ระยะเติบโตเต็มที่ คือ เป็นช่วงมี่องค์กรเจริญเติบโตอย่างเต็มที่ + อัตราการเจริญเติบโตจะช้าลง ถ้าไม่มีการพัฒนาต่อ ธุรกิจของท่านจะเข้าสู่ช่วงถดถอย และ ตายไป แต่ยังสามารถที่จะแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้าหรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของธุรกิจลดลง ถ้าหากไม่มีการพัฒนาอาจจะทำให้องค์กรมีโอกาสตายได้ ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์ คำแนะนำคือ อาจจะผลิตสินค้าหรือปรับรูปแบบผลิตภัณฑ์ใหม่ๆออกมา เพื่อสร้างความโดดเด่นให้กับแบรนด์ของเราเอง และดึงดูดลูกค้าให้สนใจมากขึ้น เพราะ ถ้าเราไม่มีการพัฒนากับการผลิตของเราต่อ จะถูกคู่แข่งแย่งลูกค้าและแบ่งส่วนครองในการตลาดไปได้มากกว่า หรือ อาจจะหาแหล่งซัพพลายเออร์ใหม่ที่จะช่วยให้ธุรกิจมีต้นทุนการผลิตต่ำลง แต่ต้องเป็นแหล่งที่ได้มาซึ่ง วัตถุดิบที่มีคุณภาพ เพื่อให้คุณภาพของสินค้าที่ผลิตออกมามีคุณภาพและเป็นที่ยอมรับ เพื่อเป็นการสร้างความ น่าเชื่อถือให้กับแบรนด์ของเราต่อไป",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเสื่อมถอย เป็นระยะที่ธุรกิจเริ่มมีประสบปัญหาต่าง ๆ และมีการลาออกของบุคคลระดับสูง ดังนั้นจึงต้องมีการวางแผนที่จะพัฒนาแผนการผลิตให้ก้าวล้ำกว่าเดิม เพราะเราต้องรีบเร่งในการพัฒนาให้เร็วที่สุดเนื่องจากถ้าไม่รีบพัฒนาแล้วจะทำให้ธุรกิจขาดทุนเนื่องจากธุรกิจคู่แข่งมีการเกิดใหม่และพัฒนาอยู่ตลอดเวลา ที่กล่าวมาจึงเป็นเหตุผลสำคัญในการเร่งลงทุนในการพัฒนาต่อไป",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเลิกกิจการ หรือก็คือธุรกิจขาดกำไร ขาดทุน ไม่ได้รับการตอบรับจากลูกค้า และไม่ว่าจะใช้กลยุทธ์อะไรก็ไม่สามารถทำให้ดีขึ้นได้ เราจึงต้องพัฒนาสินค้าของเราให้ทันสมัยหรือมีความแปลกใหม่ไปให้ต่างจากเดิม หรือก็คือการพัฒนาสินค้าหรือจะพัฒนาบุคลากรให้มีความสามารถมากยิ่งขึ้น แต่ต้องใช้เงินเป็นจำนวนที่สูงมากในระดับที่เริ่มธุรกิจใหม่ได้เลย ดังนั้นควรที่จะคิดวางแผนให้รอบครอบ",
      ],
      result2ST: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยน หรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วง ที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่ง สามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปใน ขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้จากการที่มีคู่แข่งขันในธุรกิจประเภทเดียวกันจำนวนมาก และ ความต้องการของลูกค้าในเรื่องสิ่งอำนวยความสะดวก เช่น สถานที่จอดรถ อินเทอร์เน็ต และ ความปลอดภัยของลูกค้า ดังนั้นแนะนำให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และโดดเด่น ปรับปรุงการบริการของท่านให้ลูกค้าพึงพอใจในการบริการ คำนึงถึงความพึงพอใจของลูกค้า และ มีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน   เพื่อรับมือกับผู้แข่งขันในธุรกิจประเภทเดียวกัน",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้จากการที่มีคู่แข่งขันในธุรกิจประเภทเดียวกันจำนวนมาก และ ความต้องการของลูกค้าในเรื่องสิ่งอำนวยความสะดวก เช่น สถานที่จอดรถ อินเทอร์เน็ต และ ความปลอดภัยของลูกค้า ดังนั้นแนะนำให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และโดดเด่น ปรับปรุงการบริการของท่านให้ลูกค้าพึงพอใจในการบริการ คำนึงถึงความพึงพอใจของลูกค้า และ มีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน เน้นการประชาสัมพันธ์และการสร้างโปรโมชั่นเพื่อขยายฐานลูกค้าให้กว้างขวาง  เพื่อรับมือกับผู้แข่งขันประเภทเดียวกันและผู้แข่งขันหน้าใหม่ที่กำลังดำเนินการ",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ระยะเติบโตเต็มที่ คือ เป็นช่วงมี่องค์กรเจริญเติบโตอย่างเต็มที่ + อัตราการเจริญเติบโตจะช้าลง ถ้าไม่มีการพัฒนาต่อ ธุรกิจของท่านจะเข้าสู่ช่วงถดถอย และ ตายไป แต่ยังสามารถที่จะแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้าหรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของธุรกิจลดลง ถ้าหากไม่มีการพัฒนาอาจจะทำให้องค์กรมีโอกาสตายได้ ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์ คำแนะนำคือ คิดและทำการโปรโมทในการบริการใหม่ๆ เพื่อให้ตรงกับความต้องการของลูกค้า และ สร้างความโดดเด่นและดึงดูดลูกค้าให้มาใช้บริการ พร้อมกับเป็นการรักษาฐานลูกค้าเดิมให้อยู่กับเรา เช่น บริการต่อขนตาหรือลิฟติ้งขนตา อาจจะทำการจัดโปรโมชั่นชวนเพื่อนมาด้วย ลดราคา 5%,10% ตามที่เราต้องการจะจัดโปรให้ตรงกับความต้องการของลูกค้า เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเสื่อมถอย เป็นระยะที่ธุรกิจเริ่มมีประสบปัญหาต่าง ๆ และมีการลาออกของบุคคลระดับสูงหรือบุคคลสำคัญ จึงทำให้ต้องมีการวางแผนธุรกิจใหม่อีกครั้งหรือพัฒนาการบริการของตนให้ดีขึ้น ซึ่งอาจจะมีค่าใช้จ่ายที่สูงขึ้นตามการพัฒนา แต่ถ้าไม่มีการพัฒนา ธุรกิจจะเข้าสู่ช่วงการปิดตัวซึ่งจะไม่มีกำไร และไม่ว่าจะทำวิธีอะไรก็ไม่สามารถกู้วิกฤติของธุรกิจได้อีกแล้ว ดังนั้นจึงต้องรีบการบริการและพัฒนาให้โดดเด่นกว่าที่เคยเป็นมา ",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเลิกกิจการ หรือก็คือธุรกิจขาดกำไร ขาดทุน ไม่ได้รับการตอบรับจากลูกค้า และไม่ว่าจะใช้กลยุทธ์อะไรก็ไม่สามารถทำให้ดีขึ้นได้ แต่ถ้าอยากให้ธุรกิจดำเนินกิจการต่อไปดังนั้นต้องมีการพัฒนาบุคลากร หรืออุปกรณ์ต่าง ๆ ให้ดีขึ้น หรือเพื่อสร้างความแปลกใหม่ แต่การที่จะทำเช่นนี้ก็เหมือนกับการที่สร้างธุรกิจใหม่ขึ้นมาเพราะต้องใช้เงินจำนวนมากในการพัฒนาเพื่อให้ธุรกิจดำรงอยู่ต่อไป",
      ],
      result3ST: [
        "เป็นช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้จากการมีคู่แข่งขันในตลาดประเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดขึ้นได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค เมื่อมีคู่แข่งขันที่มีจำนวนมาก แนะนำให้ท่านสร้างกลยุทธ์เพื่อรับมือกับคู่แข่งขันที่เพิ่มขึ้น และปรับปรุงธุรกิจของท่านให้น่าสนใจมากกว่าคู่แข่งขัน เช่น การทำการตลาด การประชาสัมพันธ์ให้ลูกค้าได้รู้จักมากขึ้น และการจัดทำโปรโมชั่นเพื่อดึงดูดลูกค้า เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ซึ่งธุรกิจของท่านมีจุดแข็งและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้จากการมีคู่แข่งขันในตลาดประเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดขึ้นได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค ดังนั้น แนะนำให้ท่านกำหนดกลยุทธ์เพื่อรับมือกับอุปสรรคที่อาจจะเกิดขึ้นได้ ด้วยการพัฒนาธุรกิจและป้องกันคู่แข่งหน้าใหม่ที่กำลังดำเนินกิจการ  รักษาฐานลูกค้าให้คงที่ ทำการตลาด และ ขยายฐานลูกค้าให้กว้างมากขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วง ระยะเติบโตเต็มที่ คือ เป็นช่วงมี่องค์กรเจริญเติบโตอย่างเต็มที่ + อัตราการเจริญเติบโตจะช้าลง ถ้าไม่มีการพัฒนาต่อ ธุรกิจของท่านจะเข้าสู่ช่วงถดถอย และ ตายไป แต่ยังสามารถที่จะแบ่งส่วนครองตลาดได้มากกว่าระยะอื่น ๆ ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้าหรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม อาจทำให้กำไรของธุรกิจลดลง ถ้าหากไม่มีการพัฒนาอาจจะทำให้องค์กรมีโอกาสตายได้ ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ ๆ มีการพัฒนาอยู่ตลอดเวลา โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์ เช่น ช้างมีการแจกผ้าห่มหรือเป็นสปอนเซอร์ให้กับนักฟุตบอล เพื่อรักษาภาพลักษณ์ที่ดีและกลุ่มลูกค้า เป็นต้น คำแนะนำคือ ต้องมีการปรับและพัฒนาวิธีการขาย เพื่อสร้างความโดดเด่น และเป็นการรักษาฐานลูกค้าเดิมให้อยู่กับเรา หรือ จะทำการจัดโปรโมชั่นในการขายเพื่อดึงดูดลูกค้าให้มากขึ้น ไม่เช่นนั้น จะถูกคู่แข่งแย่งลูกค้าไปได้ ",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเสื่อมถอย เป็นระยะที่ธุรกิจเริ่มมีประสบปัญหาต่าง ๆ และมีการลาออกของบุคคลระดับสูงหรือบุคคลสำคัญ แต่สามารถใช้กลยุทธ์ที่เกิดจากการจับคู่ระหว่างสภาพแวดล้อมภายในทางบวกคือจุดแข็ง (Strength) และสภาพแวดล้อมภายนอกทางลบ (Threat) เป็นการนำจุดแข็งข้อได้เปรียบขององค์กรมาป้องกันอุปสรรคซึ่งก็คือเป็นการใช้จุดแข็งเพื่อลีกเลี่ยงอุปสรรค เช่น S: ผลิตภัณฑ์มีความหลากหลาย เพื่อตอบสนองความต้องการการใช้งานที่แตกต่างกัน T: การใช้สินค้าที่ให้ความหวานทดแทนน้าตาล เช่น แอสปาแทม หญ้าหวาน",
        "หากธุรกิจของท่านอยู่ในช่วงนี้หรือก็คือระยะเลิกกิจการ หรือก็คือธุรกิจขาดกำไร ขาดทุน ไม่ได้รับการตอบรับจากลูกค้า และไม่ว่าจะใช้กลยุทธ์อะไรก็ไม่สามารถทำให้ดีขึ้นได้ ดังนั้นการที่จะทำให้ธุรกิจไปต่อได้ จึงต้องทำการพัฒนาโดยจะมีการลงทุนเป็นจำนวนมากในการพัฒนาธุรกิจที่กำลังจะปิดให้กลับขึ้นมาดำเนินต่อไปได้ก็เหมือนกับการลงทุนทำธุรกิจใหม่ เช่น การที่ธุรกิจขาดทุนและขายไม่ได้จากสินค้าเดิม เราจึงต้องหาสินค้าใหม่มาที่จะทำให้ลูกค้าสนใจ",
      ],
      result1WO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือ ธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยน หรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วง ที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่ง สามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปใน ขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีเทคโนโลยีที่ล้าสมัยและมีเงินทุนน้อยสำหรับพัฒนาเครื่องจักร ท่านสามารถได้รับโอกาสจากภาครัฐในส่วนของการลงทุนและการพัฒนา อีกทั้งยังสามารถค้นคว้าหาเทคโนโลยีใหม่ๆที่เกิดขึ้นในปัจจุบันที่เอื้อต่อธุรกิจของท่านได้ เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมี ความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะ เป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการ ทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจ หรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มี ผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ได้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีเทคโนโลยีที่ล้าสมัยและมีเงินทุนน้อยสำหรับพัฒนาเครื่องจักร ท่านสามารถได้รับโอกาสจากภาครัฐในส่วนของการลงทุนและการพัฒนา อีกทั้งยังสามารถค้นคว้าหาเทคโนโลยีใหม่ๆที่เกิดขึ้นในปัจจุบันที่เอื้อต่อธุรกิจของท่านได้ เป็นต้น",
        "ธุรกิจของท่านอยู่ในช่วงที่กำลังเติบโตเต็มที่ เป็นช่วงที่สามารถครองส่วนแบ่งการตลาดได้มากที่สุดแต่ถ้าหากท่านไม่พัฒนาอะไรเลยก็มีโอกาสที่ธุรกิจของท่านจะเริ่มอิ่มตัวและยอดขายลดน้อยลงเพราะฉะนั้นท่านต้องพัฒนาธุรกิจอยู่เสมอเพื่อยังคงรักษาฐานลูกค้าไว้ ท่านควรนำจุดอ่อนและโอกาสของท่านมาพัฒนาเป็นกลยุทธ์ที่ใช้รักษาธุรกิจเอาไว้ เช่น ธุรกิจของท่านมีเทคโนโลยีการผลิตที่ล้าสมัยอาจจะทำให้สูญเสียต้นทุนบางอย่างไปแต่ท่านมีโอกาสจากภาครัฐที่สนับสนุนการลงทุนและการพัฒนาของธุรกิจขนาดย่อมท่านท่านอาจจะลงทุนเพื่อจัดหาเทคโนโลยีใหม่ๆในการผลิตสินค้า ",
        "ธุรกิจของท่านกำลังอยู่ในระยะที่กำลังเริ่มเสื่อมถอย ยอดขายลดลง มีการลาออกของพนักงาน อาจเกิดจากการที่ขาดแรงจูงใจในการทำงาน เกิดการเบื่อหน่ายในการทำงาน ไม่เกิดความคิดสร้างสรรค์ใหม่ๆ ท่านควรหาทางแก้ไขในปัญหาต่าง ๆ ก่อนที่ธุรกิจของท่านจะถึงระยะที่ต้องปิดตัวลง ท่านควรนำเอาจุดอ่อนและโอกาสมาพัฒนาเป็นกลยุทธ์เพื่อใช้แก้ปัญหา เช่น ธุรกิจของท่านมีจุดอ่อนคือการจัดทำโปรโมชั่นที่ไม่น่าสนใจแต่โอกาสของท่านคือสินค้าที่ท่านผลิตกำลังเป็นที่นิยมมาก ท่านควรที่จะจัดทำโปรโมชั่นให้น่าสนใจดึงดูดลูกค้ามากขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ โดยที่องค์กรอาจจะมีการเสื่อมถอยมากขึ้นเรื่อย ๆ ยอดขายลดลงเรื่อย ๆ พนักงานมีการลาออก จนถึงจุดที่ไม่สามารถดำเนินกิจการต่อไปได้ หรือสังเกตได้จากการที่กิจการไม่มีกำไร ขาดทุน ไม่มีการตอบสนองจากลูกค้า รวมไปถึงผลิตสินค้าใหม่ๆออกมาจำหน่าย แต่ยอดขายกลับไม่เพิ่ม หรือยอดขายกลับลดลง หรืออาจจะส่งผลให้ธุรกิจขาดทุนจากการผลิตสินค้าตัวใหม่ออกมาจำหน่าย เนื่องจากมีการใช้ต้นทุนในการผลิตเพิ่มขึ้น ซึ่งกิจการสามารถแก้ไข หรือมีแนวทางการพัฒนาเพื่อให้กิจการดำเนินต่อไปได้ นั่นคือการสังเกตจุดอ่อนที่ทางกิจการตนเองมี และนำโอกาสที่สามารถนำมาปรับใช้ได้ในปัจจุบันมาปรับใช้กับกิจการของตนเอง เช่น หากสินค้าที่ผลิตออกมาสู้กับสินค้าของคู่แข่งขันไม่ได้ กิจการควรพิจารณาว่าสู้ไม่ได้ในด้านใด ยกตัวอย่างเช่น ด้านคุณภาพ เมื่อทราบว่ากิจการตนเองมีจุดอ่อนในด้านนี้ กิจการก็ต้องหาวัตถุดิบที่มีคุณภาพเพื่อให้ลูกค้าเชื่อถือในแบรนด์ หลังจากนั้นจึงใช้โอกาสที่เป็นไปได้มากที่สุดมาช่วยให้กินการสามารถดำเนินต่อไปได้ เช่น การสำรวจพฤติกรรมผู้บริโภคว่าในขณะนั้นผู้บริโภคมีความต้องการสิ่งใดมากที่สุด จึงค่อยทำการผลิตสิ่งนั้นให้มีจำนวนเพียงพอต่อผู้บริโภค",
      ],
      result2WO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือ ธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยน หรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วง ที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่ง สามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปใน ขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีจุดอ่อนด้านช่องทางการจัดจำหน่ายน้อย ท่านต้องใช้สื่อโฆษณาทางอินเทอร์เน็ตที่ใช้กันอย่างแพร่หลายเพื่อประชาสัมพันธ์ธุรกิจของท่าน เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมี ความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะ เป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการ ทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจ หรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มี ผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีจุดอ่อนด้านช่องทางการจัดจำหน่ายน้อย ท่านต้องใช้สื่อโฆษณาทางอินเทอร์เน็ตที่ใช้กันอย่างแพร่หลายเพื่อประชาสัมพันธ์ธุรกิจของท่าน เป็นต้น         ",
        "ธุรกิจของท่านอยู่ในช่วงที่กำลังเติบโตเต็มที่ เป็นช่วงที่สามารถครองส่วนแบ่งการตลาดได้มากที่สุดแต่ถ้าหากท่านไม่พัฒนาอะไรเลยก็มีโอกาสที่ธุรกิจของท่านจะเริ่มอิ่มตัวและยอดขายลดน้อยลงเพราะฉะนั้นท่านต้องพัฒนาธุรกิจอยู่เสมอเพื่อยังคงรักษาฐานลูกค้าไว้ท่านควรนำจุดอ่อนและโอกาสของท่านมาพัฒนาเป็นกลยุทธ์ที่ใช้รักษาธุรกิจเอาไว้ เช่น จุดอ่อนของท่านคือไม่มีการประชาสัมพันธ์อย่างต่อเนื่องแต่โอกาสของท่านคือมีการสื่อสารผ่านโลกออนไลน์อย่างรวดเร็ว ท่านควรที่จะใช้สื่ออนไลน์ประชาสัมพันธ์ธุรกิจของท่านอย่างสม่ำเสมอ",
        "ธุรกิจของท่านกำลังอยู่ในระยะที่กำลังเริ่มเสื่อมถอย ยอดขายลดลง มีการลาออกของพนักงาน อาจเกิดจากการที่ขาดแรงจูงใจในการทำงาน เกิดการเบื่อหน่ายในการทำงาน ไม่เกิดความคิดสร้างสรรค์ใหม่ๆ ท่านควรหาทางแก้ไขในปัญหาต่าง ๆ ก่อนที่ธุรกิจของท่านจะถึงระยะที่ต้องปิดตัวลง ท่านควรนำเอาจุดอ่อนและโอกาสมาพัฒนาเป็นกลยุทธ์เพื่อใช้แก้ปัญหา เช่น หากธุรกิจท่านมีจุดอ่อนคือพนักงานมีจำนวนจำกัดไม่เพียงพอต่อลูกค้าแต่โอกาสของท่านคือการสื่อสารออนไลน์ที่รวดเร็ว ท่านควรประชาสัมพันธ์และสร้างแรงจูงใจในการจัดหาพนักงานผ่านช่องทางออนไลน์",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ โดยที่องค์กรอาจจะมีการเสื่อมถอยมากขึ้นเรื่อย ๆ ยอดขายลดลงเรื่อย ๆ พนักงานมีการลาออก จนถึงจุดที่ไม่สามารถดำเนินกิจการต่อไปได้ หรือสังเกตได้จากการที่กิจการไม่มีกำไร ขาดทุน ไม่มีการตอบสนองจากลูกค้า (จัดโปรโมชั่นใด ๆ ลูกค้าก็ไม่สนใจที่จะเข้ามาใช้บริการ) รวมไปถึงลูกค้าที่เข้ามาใช้บริการมีจำนวนลดลงอย่างเห็นได้ชัด ซึ่งกิจการสามารถแก้ไข หรือมีแนวทางการพัฒนาเพื่อให้กิจการดำเนินต่อไปได้ นั่นคือการสังเกตจุดอ่อนที่ทางกิจการตนเองมี และนำโอกาสที่สามารถนำมาปรับใช้ได้ในปัจจุบันมาปรับใช้กับกิจการของตนเอง เช่น ร้านเสริมสวยมีอัตราค่าบริการที่ค่อนข้างสูงมากเกินไปทำให้ลูกค้าบางกลุ่มที่มีรายได้น้อยไม่มาใช้บริการ ทางร้านจึงควรมีการปรับอัตราค่าบริการลงเพื่อให้ลูกค้าสามารถเข้าใช้บริการได้ทุกกลุ่ม ทุกวัย และเนื่องด้วยปัจจุบันสื่อทางอินเตอร์เน็ตเป็นสื่อกลางสามารถส่งต่อถึงลูกค้าได้รวดเร็ว กิจการอาจจะมีการจัดโปรโมชั่น สร้างแรงดึงดูดเพื่อให้ลูกค้าเข้ามาใช้บริการให้มากยิ่งขึ้น เพื่อเป็นการสร้างรายได้ให้กิจการสามารถดำเนินต่อไปได้",
      ],
      result3WO: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือ ธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยน หรือหมุนเวียนงานกันทำได้ ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าอยู่ในช่วง ที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่ง สามารถโจมตีเราได้ง่าย ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด เพื่อให้สามารถก้าวไปใน ขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีเงินทุนที่น้อย แต่จะมีโอกาสได้รับเงินสนับสนุนจากหน่วยงานรัฐบาลเพราะรัฐบาลมีนโยบายส่งเสริมธุรกิจขนาดย่อม เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าองค์กรหรือธุรกิจของท่านนั้นอยู่ในช่วงที่เริ่มมี ความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะ เป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการ ทำงานและวิสัยทัศน์ที่ชัดเจน ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า โดยทำการตลาดให้ธุรกิจ หรือแบรนด์เป็นที่รู้จักมากขึ้น มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มี ผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้ ซึ่งธุรกิจของท่านต้องใช้การสังเกตจุดอ่อนของธุรกิจ และนำโอกาสที่มีมาปรับใช้ในธุรกิจของท่านเพื่อให้ธุรกิจของท่านเติบโตได้อย่างเต็มที่ เช่น หากธุรกิจของท่านมีเงินทุนที่น้อย แต่จะมีโอกาสได้รับเงินสนับสนุนจากหน่วยงานรัฐบาลเพราะรัฐบาลมีนโยบายส่งเสริมธุรกิจขนาดย่อม เป็นต้น",
        "ธุรกิจของท่านอยู่ในช่วงที่กำลังเติบโตเต็มที่ เป็นช่วงที่สามารถครองส่วนแบ่งการตลาดได้มากที่สุดแต่ถ้าหากท่านไม่พัฒนาอะไรเลยก็มีโอกาสที่ธุรกิจของท่านจะเริ่มอิ่มตัวและยอดขายลดน้อยลงเพราะฉะนั้นท่านต้องพัฒนาธุรกิจอยู่เสมอเพื่อยังคงรักษาฐานลูกค้าไว้ ท่านควรนำจุดอ่อนและโอกาสของท่านมาพัฒนาเป็นกลยุทธ์ที่ใช้รักษาธุรกิจเอาไว้ เช่น จุดอ่อนของท่านคือกิจการขาดเงินทุนหมุนเวียนแต่ท่านมีโอกาสคือภาครัฐส่งเสริมการลงทุนสำหรับธุรกิจขนาดย่อมท่านควรที่จะลงทุนเพิ่มหรือขยายโอกาสอื่น ๆ ให้แก่ธุรกิจ (ทั้งนี้การลงทุนเพิ่มขึ้นอยู่กับปัจจัยภายนอก สภาพเศรษฐกิจ ฯลฯ) ",
        "ธุรกิจของท่านกำลังอยู่ในระยะที่กำลังเริ่มเสื่อมถอย ยอดขายลดลง มีการลาออกของพนักงาน อาจเกิดจากการที่ขาดแรงจูงใจในการทำงาน เกิดการเบื่อหน่ายในการทำงาน ไม่เกิดความคิดสร้างสรรค์ใหม่ๆ ท่านควรหาทางแก้ไขในปัญหาต่าง ๆ ก่อนที่ธุรกิจของท่านจะถึงระยะที่ต้องปิดตัวลง ท่านควรนำเอาจุดอ่อนและโอกาสมาพัฒนาเป็นกลยุทธ์เพื่อใช้แก้ปัญหา เช่น การสร้างแรงจูงใจและแรงกระตุ้นในการทำงาน ",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ โดยที่องค์กรอาจจะมีการเสื่อมถอยมากขึ้นเรื่อย ๆ ยอดขายลดลงเรื่อย ๆ คนงานเกิดการลาออกเพิ่มมากขึ้น จนถึงจุดที่ไม่สามารถดำเนินกิจการต่อไปได้ หรือสังเกตได้จากการที่กิจการไม่มีกำไร ขาดทุน ไม่มีการตอบสนองจากลูกค้า (จัดโปรโมชั่นใด ๆ ลูกค้าก็ไม่สนใจ) ซึ่งธุรกิจสามารถแก้ไขได้หรือพัฒนาได้แต่อาจจะต้องใช้ต้นทุนค่าใช้จ่ายในการพัฒนาสูงมากเหมือนต้องเริ่มสร้างธุรกิจใหม่ เพราะเหตุนี้ผู้บริหารจึงไม่ควรปล่อยให้ธุรกิจเข้าสู่ช่วง Death ดังแผนภาพที่แสดงให้เห็น  โดยสามารถแก้ไข หรือพัฒนาธุรกิจให้สามารถกลับมาดพเนินกิจการต่อไปได้ คือ สังเกตจุดอ่อนที่กิจการตนเองมี และใช้โอกาสที่คิดว่าจะเป็นไปได้สูงมาปรับใช่ เช่น หากทางกิจการมีช่องทางการจัดจำหน่ายที่น้อย และในปัจจุบันสื่อทางอินเตอร์เน็ตคือสื่อกลางที่สื่อสารกันได้ง่ายและรวดเร็ว ดังนั้นกิจการควรใช้เทคโนโลยีในการประชาสัมพันธ์เพื่อให้ลูกค้าสามารถเข้าถึงได้ เพื่อเป็นการสร้างฐานลูกค้า รวมไปถึงสร้างรายได้ให้กิจการสามารถดำเนินต่อไปได้",
      ],
      result1WT: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ เจ้าของกิจการอาจจะลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าเป็นช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจของเราพึ่งจัดขึ้น และไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้ต้องประคับประคองธุรกิจให้ธุรกิจสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค อุปสรรคนั้นอาจเกิดจากสินค้าสามารถลอกเลียนแบบได้ง่าย มีคู่แข่งในธุรกิจประเภทเดียวกันจำนวนมาก หรือพฤติกรรมของลูกค้าเปลี่ยนแปลงไป คำแนะนำคือให้ท่านกำหนดกลยุทธ์เพื่อรับมือและป้องกันกับอุปสรรคที่เกิดขึ้นได้ และให้ท่านนำจุดอ่อนของธุรกิจของท่านมาปรับปรุงให้ธุรกิจของท่านนั้นดีขึ้น เพื่อธุรกิจของท่านให้อยู่รอดต่อไป",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะ ก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ฃึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค อุปสรรคนั้นอาจเกิดจากสินค้าสามารถลอกเลียนแบบได้ง่าย มีคู่แข่งในธุรกิจประเภทเดียวกันจำนวนมาก หรือพฤติกรรมของลูกค้าเปลี่ยนแปลงไป คำแนะนำคือให้ท่านกำหนดกลยุทธ์เพื่อรับมือและป้องกันกับอุปสรรคที่เกิดขึ้นได้ และให้ท่านนำจุดอ่อนของธุรกิจของท่านมาปรับปรุงให้ธุรกิจของท่านนั้นดีขึ้น เพื่อธุรกิจของท่านให้อยู่รอดต่อไป",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจเติบโตเต็มที่ กล่าวคือเป็นระยะที่กิจการมีกำไรเป็นจำนวนมาก เป็นช่วงที่สามารถครองส่วนแบ่งทางการตลาดได้มากกว่าระยะอื่น ๆ และหากไม่มีการพัฒนาเพื่อหาแนวทางทำให้ยอดขายเพิ่มขึ้นกิจการจะสามารถเข้าสู่ช่วงเสื่อมถอย และอาจจะส่งผลถึงขั้นต้องปิดการได้ในอนาคต ดังนั้นผู้ประกอบการต้องคิด วางแผน เริ่มหาแนวทางใหม่ๆในการพัฒนาสินค้า และระบบภายในกิจการของตนเองอยู่ตลอดเวลาเพื่อให้กิจการดำเนินต่อไปสามารถสู้กับคู่แข่งได้ รวมถึงเพื่อดึงดูดให้ลูกค้ามาซื้อสินค้าที่กิจการได้ผลิตออกมาจำหน่ายมากยิ่งขึ้น ซึ่งกิจการสามารถใช้แนวทางการป้องกัน โดยให้สังเกตจุดอ่อนที่กิจการตนเองมีอยู่ และสังเกตอุปสรรคจากภายนอกที่กิจการไม่สามารถควบคุมได้ แล้วนำมาวิเคราะห์เพื่อหาแนวทางป้องกันและหลีกเลี่ยงสถานการณ์ให้กิจการไม่แย่ไปมากกว่าเดิม เช่น ธุรกิจชานมไข่มุกที่ผลิตไข่มุกเอง อาจจะพบกับปัญหาที่การผลิตในมุกในแต่ละวันไม่เพียงพอต่อลูกค้า และมีคู่แข่งหลายรายในตลาดประเภทเดียวกัน ซึ่งผู้ประกอบการควรจะหาแนวเพื่อป้องกันไม่ให้ฐานลูกค้าเสียไปให้ได้ ซึ่งอาจจะทำโดยการจัดโปรโมชั่นบางเมนูเพื่อดึงดูงให้ลูกค้ายังซื้อแม้เครื่องบางประเภคที่ใส่ไข่มุกจะหมด หรืออาจจะหาแนวทางในการผลิตไข่มุกในแต่ละวันได้จำนวนเพิ่มขึ้นมากกว่าเดิม อีกทั้งผู้ประกอบการควรใส่ใจในเรื่องการทำการตลาดให้ได้มากที่สุด เพราะปัจจุบันธุรกิจชานมไข่มุกมีมากมายในทุกพื้นที่ ดังนั้นเพื่อไม่ให้ธุรกิจของตนเองเสื่อมถอย ควรจะมีการประชาสัมพันธ์ จัดกิจกรรมให้กับกิจการอยู่ตลอด เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกาลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคาสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน คำแนะนำคือการดึงจุดอ่อนและโอกาส เป็นกลยุทธ์เพื่อการลดจุดอ่อนและหลีกเลี่ยงภัยคุกคามโดยมีเป้าหมายหลักคือการป้องกันหรือหลีกเลี่ยงให้สถานการณ์ขององค์กรไม่แย่ไปกว่าเดิม ตัวอย่างเช่น จุดอ่อน คือ ผลิตภัณฑ์น้ำตาลเบเกอรีของบริษัท เป็นผลิตภัณฑ์ใหม่ที่กำลังจะเข้าสู่ตลาด ทำให้ยังไม่เป็นที่รู้จักมากนัก ส่วนด้านโอกาส คือ การใช้สินค้าที่ให้ความหวานทดแทนน้ำตาล เช่น แอสปาแทม หญ้าหวาน เพื่อเป็นส่วนผสมของผลิตภัณฑ์ และ จับคู่เป็นกลยุทธ์ โดย ทำการจัดกิจกรรมส่งเสริมทางการตลาด เช่น การจัดกิจกรรม ชุดความหวาน มอบความสุข โดยมีการจัดกิจกรรม หรือ การออกอีเวนท์ เพื่อทำให้ผู้บริโภคคิดว่าน้ำตาลไม่ใช่สิ่งที่น่ากลัวอย่างที่คิด",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ โดยที่องค์กรอาจจะมีการเสื่อมถอยมากขึ้นเรื่อย ๆ ยอดขายลดลงเรื่อย ๆ คนงานเกิดการลาออกเพิ่มมากขึ้น จนถึงจุดที่ไม่สามารถดำเนินกิจการต่อไปได้ หรือสังเกตได้จากการที่กิจการไม่มีกำไร ขาดทุน ไม่มีการตอบสนองจากลูกค้า  แม้แต่การจัดโปรโมชั่นใด ๆ ลูกค้าก็ไม่สนใจ ซึ่งธุรกิจสามารถแก้ไขได้หรือพัฒนาได้แต่อาจจะต้องใช้ต้นทุนค่าใช้จ่ายในการพัฒนาสูงมากเหมือนต้องเริ่มสร้างธุรกิจใหม่ เพราะเหตุนี้ผู้บริหารจึงไม่ควรปล่อยให้ธุรกิจเข้าสู่ช่วง Death ดังแผนภาพที่แสดงให้เห็น สามารถแก้ไขหรือพัฒนาธุรกิจให้สามารถกลับมาดพเนินกิจการต่อไปได้ โดยการดึงจุดอ่อนและโอกาส เป็นกลยุทธ์เพื่อการลดจุดอ่อนและหลีกเลี่ยงภัยคุกคามโดยมีเป้าหมายหลักคือการป้องกันหรือหลีกเลี่ยงให้สถานการณ์ขององค์กรไม่แย่ไปกว่าเดิม ตัวอย่างเช่น จุดอ่อน คือ ผลิตภัณฑ์น้ำตาลเบเกอรีของบริษัท เป็นผลิตภัณฑ์ใหม่ที่กำลังจะเข้าสู่ตลาด ทำให้ยังไม่เป็นที่รู้จักมากนัก ส่วนด้านโอกาส คือ การใช้สินค้าที่ให้ความหวานทดแทนน้ำตาล เช่น แอสปาแทม หญ้าหวาน เพื่อเป็นส่วนผสมของผลิตภัณฑ์ และ จับคู่เป็นกลยุทธ์ โดย ทำการจัดกิจกรรมส่งเสริมทางการตลาด เช่น การจัดกิจกรรม ชุดความหวาน มอบความสุข โดยมีการจัดกิจกรรม หรือ การออกอีเวนท์ เพื่อทำให้ผู้บริโภคคิดว่าน้ำตาลไม่ใช่สิ่งที่น่ากลัวอย่างที่คิด",
      ],
      result2WT: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ เจ้าของกิจการอาจจะลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าเป็นช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจของเราพึ่งจัดขึ้น และไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้ต้องประคับประคองธุรกิจให้ธุรกิจสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค ซึ่งอุปสรรคนั้นอาจเกิดจากการมีคู่แข่งขันในตลาดปะเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมากและความต้องการของลูกค้าในเรื่องสิ่งอำนวยความสะดวก เช่น บริการหลังการขาย สถานที่จอดรถ อินเทอร์เน็ต ร่วมไปถึงความปลอดภัยของลูกค้า ดังนั้นคำแนะนำของธุรกิจของท่านคือ ให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และความโดดเด่น ปรับปรุงการให้บริการของท่านให้เป็นที่พึ่งพอใจต่อลูกค้า และมีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน เพื่อป้องกันคู่แข่งในธุรกิจประเภทเดียวกัน",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะ ก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ฃึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค ซึ่งอุปสรรคนั้นอาจเกิดจากการมีคู่แข่งขันในตลาดปะเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมากและความต้องการของลูกค้าในเรื่องสิ่งอำนวยความสะดวก เช่น บริการหลังการขาย สถานที่จอดรถ อินเทอร์เน็ต ร่วมไปถึงความปลอดภัยของลูกค้า ดังนั้นคำแนะนำของธุรกิจของท่านคือ ดังนั้นคำแนะนำของธุรกิจของท่านคือ ให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และความโดดเด่น ปรับปรุงการให้บริการของท่านให้เป็นที่พึ่งพอใจต่อลูกค้า และมีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน เพื่อป้องกันคู่แข่งในธุรกิจประเภทเดียวกัน และนำจุดอ่อนธุรกิจของท่านมาปรับปรุงแก้ไขให้ดีขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจเติบโตเต็มที่ กล่าวคือเป็นระยะที่กิจการมีกำไรเป็นจำนวนมาก ฐานลูกค้ารวมถึงรายได้อยู่ในระดับคงที่ กล่าวคืออาจจะไม่เพิ่มไปมากกว่านี้ และหากกิจการไม่มีแนวทางให้การให้บริการให้ประทับใจลูกค้า หรือฝีมือในการทำงานลดลงก็อาจจะส่งผลให้กิจการสามารถเข้าสู่ช่วงเสื่อมถอย หรืออาจะร้ายแรงถึงขั้นปิดการได้ ดังนั้นผู้ประกอบการต้องคิด วางแผน เริ่มหาแนวทางใหม่ๆในการพัฒนากิจการของตนเองอยู่ตลอดเวลาเพื่อให้กิจการดำเนินต่อไปสามารถสู้กับคู่แข่ง รวมถึงเพื่อดึงดูดให้ลูกค้ามาใช้บริการมากยิ่งขึ้น ซึ่งกิจการสามารถใช้แนวทางการป้องกัน โดยให้สังเกตจุดอ่อนที่กิจการตนเองมีอยู่ และสังเกตอุปสรรคจากภายนอกที่กิจการไม่สามารถควบคุมได้ แล้วนำมาวิเคราะห์เพื่อหาแนวทางป้องกันและหลีกเลี่ยงสถานการณ์ให้กิจการไม่แย่ไปมากกว่าเดิม เช่น ธุรกิจร้านเสริมสวย อาจจะพบกับปัญหาที่พนักงานในร้านไม่เพียงพอต่อลูกค้าที่เข้ามารับบริการทำให้บางครั้งลุกค้าไม่รอ จนทำให้ต้องเสียลูกค้ารวมถึงรายได้ไป และคู่แข่งมีค่อนข้างมากเนื่องจากเป็นธุรกิจที่สามารถทำได้ง่าย ดังนั้นผู้ประกอบการหรือเจ้าของร้านควรคิดหาแนวทางเพื่อต่อสู่กับคู่แข่งให้ได้ เช่น การเพิ่มจำนวนพนักงานเพื่อให้เพียงพอต่อลุกค้าที่เข้ามารับบริการ จัดระบบคิวอย่างชัดเจนเพื่อให้ลูกค้าไม่รอนาน รวมถึงอบรมพนักงานให้ยิ้มแย้ม แจ่มใส พร้อมให้บริการลูกค้าด้วยความเต็มใจ สร้างบรรยากาศภายในร้านให้เสมือนที่ที่ให้ลุกค้าได้ผ่อนคลาย รวมถึงมีการรับฟังคำติชมลูกค้าทุกคนเพื่อปรับปรุงแก้ไขในสิ่งที่ธุรกิจตนเองยังทำได้ไม่ดีเท่าที่ควร เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกาลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคาสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน ดังนั้นคำแนะนำของธุรกิจของท่านคือ ให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และความโดดเด่น ปรับปรุงการให้บริการของท่านให้มีมาตรฐาน เป็นที่พึ่งพอใจต่อลูกค้า และมีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน เพื่อป้องกันคู่แข่งในธุรกิจประเภทเดียวกัน และนำจุดอ่อนธุรกิจของท่านมาปรับปรุงแก้ไขให้ดีขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ โดยที่องค์กรอาจจะมีการเสื่อมถอยมากขึ้นเรื่อย ๆ ยอดขายลดลงเรื่อย ๆ คนงานเกิดการลาออกเพิ่มมากขึ้น จนถึงจุดที่ไม่สามารถดำเนินกิจการต่อไปได้ หรือสังเกตได้จากการที่กิจการไม่มีกำไร ขาดทุน ไม่มีการตอบสนองจากลูกค้า  แม้แต่การจัดโปรโมชั่นใด ๆ ลูกค้าก็ไม่สนใจ ซึ่งธุรกิจสามารถแก้ไขได้หรือพัฒนาได้แต่อาจจะต้องใช้ต้นทุนค่าใช้จ่ายในการพัฒนาสูงมากเหมือนต้องเริ่มสร้างธุรกิจใหม่ เพราะเหตุนี้ผู้บริหารจึงไม่ควรปล่อยให้ธุรกิจเข้าสู่ช่วง Death ดังแผนภาพที่แสดงให้เห็น สามารถแก้ไขหรือพัฒนาธุรกิจให้สามารถกลับมาดพเนินกิจการต่อไปได้ ดังนั้นคำแนะนำของธุรกิจของท่านคือ ให้ท่านสร้างเอกลักษณ์ของธุรกิจให้มีความแปลกใหม่และความโดดเด่น ปรับปรุงการให้บริการของท่านให้มีมาตรฐาน เป็นที่พึ่งพอใจต่อลูกค้า และมีสิ่งอำนวยความสะดวกแก่ลูกค้าอย่างครบครัน เพื่อป้องกันคู่แข่งในธุรกิจประเภทเดียวกัน และนำจุดอ่อนธุรกิจของท่านมาปรับปรุงแก้ไขให้ดีขึ้น",
      ],
      result3WT: [
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น โดยองค์กรอาจจะยังไม่ใหญ่โตมาก การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้ เจ้าของกิจการอาจจะลงมาทำงานด้วยเช่นกัน ระยะนี้ถือว่าเป็นช่วงที่อ่อนแอ ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจของเราพึ่งจัดขึ้น และไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย ในระยะนี้ต้องประคับประคองธุรกิจให้ธุรกิจสามารถอยู่รอด เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้ ซึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค อุปสรรคนั้นอาจเกิดจากการมีคู่แข่งขันในตลาดปะเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค เมื่อมีคู่แข่งเพิ่มมากขึ้น แนะนำให้ท่านได้คิดกลยุทธ์ขึ้นมาเพื่อรับมือคู่แข่งที่เพิ่มขึ้น และปรับปรุงธุรกิจของท่านให้โดดเด่น น่าสนใจ มากกว่าคู่แข่ง เช่น มีการประชาสัมพันธ์เพิ่มมากขั้น การจัดทำโปรโมชั่นเพื่อดึงดูดลูกค้า เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ ธุรกิจของท่านเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้ มีการขยายกำลังคนและมีกำลังที่จะ ก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร มีลำดับขั้นของสายบังคับบัญชา นโยบาย แผนการทำงานและวิสัยทัศน์ที่ชัดเจน ฃึ่งธุรกิจของท่านมีจุดอ่อนและอุปสรรค อุปสรรคนั้นอาจเกิดขึ้นได้จากการมีคู่แข่งขันในตลาดประเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดขึ้นได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค  แนะนำให้ท่านคิดกำหนดกลยุทธ์เพื่อรับมือและป้องกันกับอุปสรรคที่เกิดขึ้นได้ ด้วยการพัฒนาและป้องกันธุรกิจ รักษาฐานลูกค้าให้คงที่ ขยายฐานลูกค้าให้กว้างขึ้น เป็นต้น และนำจุดอ่อนธุรกิจของท่านมาปรับปรุงแก้ไขให้ดีขึ้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบ่งบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงที่องค์กรหรือธุรกิจของท่านกำลังเข้าสู่ช่วงที่ธุรกิจเติบโตเต็มที่ กล่าวคือเป็นระยะที่กิจการมีกำไรเป็นจำนวนมาก เป็นช่วงที่สามารถครองส่วนแบ่งทางการตลาดได้มากกว่าระยะอื่น ๆ และหากไม่มีการพัฒนาเพื่อหาแนวทางทำให้ยอดขายเพิ่มขึ้นกิจการจะสามารถเข้าสู่ช่วงเสื่อมถอยได้ แล้วอาจจะส่งผลถึงขั้นต้องปิดการได้ในอนาคต ดังนั้นผู้ประกอบการต้องคิด วางแผน เริ่มหาแนวทางใหม่ๆในการพัฒนากิจการของตนเองอยู่ตลอดเวลาเพื่อให้กิจการดำเนินต่อไปสามารถสู้กับคู่แข่งได้ รวมถึงเพื่อดึงดูดให้ลูกค้ามาซื้อสินค้ามากยิ่งขึ้น ซึ่งกิจการสามารถใช้แนวทางการป้องกัน โดยให้สังเกตจุดอ่อนที่กิจการตนเองมีอยู่ และสังเกตอุปสรรคจากภายนอกที่กิจการไม่สามารถควบคุมได้ แล้วนำมาวิเคราะห์เพื่อหาแนวทางป้องกันและหลีกเลี่ยงสถานการณ์ให้กิจการไม่แย่ไปมากกว่าเดิม เช่น ธุรกิจร้านขายของชำ สินค้าจำพวกบริโภคจะมีวันหมดอายุ และในปัจจุบันหลายพื้นที่กำลังประสบกับปัญหาโรคระบาด Covid-19 ผู้คนจึงไม่ค่อยออกนอกบ้าน เพราะกลัวโรคระบาด ดังนั้นเพื่อไม่ให้สินค้าต้องหมดอายุโดยเปล่าประโยชน์ รวมถึงเผื่อลดการขาดทุนของกิจการ ผู้ประกอบควรมีการจัดโปรโมชั่นเพื่อดึงดูดให้ลูกค้ามาซื้อสินค้าไว้กักตุนช่วงเกิดโรค เช่น การลดราคา การใช้โปรโมชั่น 1 แถม 1 เป็นต้น",
        "หากธุรกิจของท่านอยู่ในระยะนี้ สามารถบ่งบอกได้ว่า เป็นระยะที่องค์การหรือธุรกิจกำลังประสบปัญหาต่าง ๆ เช่น พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง พนักงานปฏิบัติตามคำสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์ เป็นของตนเอง สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน คำแนะนำคือ นำข้อมูลการประเมินสภาพแวดล้อมที่เป็นจุดอ่อนและอุปสรรคมาพิจารณาร่วมกัน เพื่อที่จะนำมากำหนดเป็นยุทธ์ศาสตร์หรือกลยุทธ์ในเชิงรับ ทั้งนี้เนื่องจากธุรกิจเผชิญกับทั้งจุดอ่อนและข้อุปสรรคภายนอกที่องค์การไม่สามารถควบคุมได้ อุปสรรคนั้นอาจเกิดจากการมีคู่แข่งขันในตลาดปะเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค เมื่อมีคู่แข่งเพิ่มมากขึ้น แนะนำให้ท่านได้คิดกลยุทธ์ขึ้นมาเพื่อรับมือคู่แข่งที่เพิ่มขึ้น และปรับปรุงธุรกิจของท่านให้โดดเด่น น่าสนใจมากกว่าคู่แข่ง เช่น มีการประชาสัมพันธ์เพิ่มมากขั้น การจัดทำโปรโมชั่นเพื่อดึงดูดลูกค้า การอบรมพนักงาน สร้างมาตรฐานที่ดีกว่าเดิม เป็นต้น",
        "หากธุรกิจของท่านอยู่ในช่วงนี้ สามารถบอกได้ว่าธุรกิจของท่านนั้นอยู่ในช่วงถดถอยขององค์การมากขึ้นอาจกำลังเข้าสู่ช่วงที่ธุรกิจต้องปิดกิจการหรือยุบกิจการ ยอดขายลดลงเรื่อย ๆ คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่าง ๆ ได้ ซึ่งอาจสังเกตุได้จาก กิจการไม่มีกำไร ขาดทุน ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้ ในช่วงนี้กิจการสามารถดำเนินต่อไปได้ แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก เหมือนเป็นการเริ่มต้นกิจการใหม่ คำแนะนำคือ นำข้อมูลการประเมินสภาพแวดล้อมที่เป็นจุดอ่อนและอุปสรรคมาพิจารณาร่วมกัน เพื่อที่จะนำมากำหนดเป็นยุทธ์ศาสตร์หรือกลยุทธ์ในเชิงรับ ทั้งนี้เนื่องจากธุรกิจเผชิญกับทั้งจุดอ่อนและข้อุปสรรคภายนอกที่องค์การไม่สามารถควบคุมได้ อุปสรรคนั้นอาจเกิดจากการมีคู่แข่งขันในตลาดปะเภทเดียวกันเพิ่มขึ้นเป็นจำนวนมาก หรืออาจเกิดได้จากการปรับเปลี่ยนพฤติกรรมของผู้บริโภค เมื่อมีคู่แข่งเพิ่มมากขึ้น แนะนำให้ท่านได้คิดกลยุทธ์ขึ้นมาเพื่อรับมือคู่แข่งที่เพิ่มขึ้น และปรับปรุงธุรกิจของท่านให้โดดเด่น น่าสนใจมากกว่าคู่แข่ง เช่น มีการประชาสัมพันธ์เพิ่มมากขั้น การจัดทำโปรโมชั่นเพื่อดึงดูดลูกค้า การอบรมพนักงาน สร้างมาตรฐานที่ดีกว่าเดิม เป็นต้น",
      ],
      finalResult: [],
      categoryResult: "",
      olcPhraseResult: "",
      businessResult: "",
    };
  }

  // Before render
  componentDidMount = async () => {
    await localStorage.setItem("isFinished", true);
    let detailsArr = [];
    let details;
    let swotResultPage = parseInt(localStorage.getItem("swot-result-page"));
    switch (swotResultPage) {
      case 1:
        details = JSON.parse(localStorage.getItem("finalScore"));
        break;
      case 2:
        details = JSON.parse(localStorage.getItem("finalScore2"));
        break;
      case 3:
        details = JSON.parse(localStorage.getItem("finalScore3"));
        break;
      default:
    }
    detailsArr.push(
      {
        name: "strength",
        number: parseFloat(details[0]),
      },
      {
        name: "weakness",
        number: parseFloat(-details[1]),
      },
      {
        name: "opportunity",
        number: parseFloat(details[2]),
      },
      {
        name: "threat",
        number: parseFloat(-details[3]),
      }
    );
    console.log(detailsArr);

    // await this.setState({
    //   data: {
    //     datasets: [
    //       {
    //         data: [
    //           { x: 0, y: detailsArr[0].number },
    //           { x: 0, y: detailsArr[1].number },
    //           { x: detailsArr[2].number, y: 0 },
    //           { x: detailsArr[3].number, y: 0 },
    //         ],
    //       },
    //     ],
    //   },
    // });

    switch (true) {
      case detailsArr[0].number >= -detailsArr[1].number &&
        detailsArr[2].number >= -detailsArr[3].number:
        await this.setState({
          isSO: true,
          data: {
            datasets: [
              {
                data: [{ x: detailsArr[2].number, y: detailsArr[0].number }],
              },
            ],
          },
          mode:
            "หากธุรกิจหรือกิจการของท่านอยู่ในช่วง SO หรือช่วง Star ผลิตภัณฑ์อยู่ในช่วงกำลังเติบโต มีความต้องการในตลาดมาก ควรรักษาตัวเองให้อยู่ในตลาดต่อไปให้นานที่สุด แน่นอนว่าเติบโตก็ดี ส่วนแบ่งก็เยอะ คู่เเข่งก็จะเข้ามาเรื่อยๆ จึงต้องรักษามาตรฐานและครองใจลูกค้าให้ได้มากที่สุดเพราะเป็นช่วงที่มีคู่แข่งมากสามารถแย่งส่วนครองทางการตลาดได้เสมอๆ เช่น การที่สินค้าที่ผลิตออกมานั้นเป็นที่ได้รับความนิยมอย่างมาก ดังนั้นเราจึงควรที่จะรักษาช่วงเวลานี้ให้นานที่สุด ไม่ว่าจะเป็นการสนับสนุนโครงการต่างๆหรือจะโฆษณาเกี่ยวกับสินค้าที่ผลิตออกมาให้เป็นที่ยอมรับมากยิ่งขึ้น เพื่อที่จะทำให้ธุรกิจการผลิตอยู่ได้อย่างยั่งยืน",
        });

        break;

      case detailsArr[0].number >= -detailsArr[1].number &&
        detailsArr[2].number < -detailsArr[3].number:
        await this.setState({
          isST: true,
          data: {
            datasets: [
              {
                data: [{ x: detailsArr[3].number, y: detailsArr[0].number }],
              },
            ],
          },
          mode:
            "หากธุรกิจหรือกิจการของท่านอยู่ในช่วง ST หรือ cash cow คือช่วงที่เป็นผลิตภัณฑ์ที่มีอัตราการเจริญเติบโตของยอดขายต่ำ ส่วนครองตลาดเปรียบเทียบสูง โดยสาเหตุที่อัตราการเจริญเติบโตของยอดขายลดลงเพราะผลิตภัณฑ์เข้าสู่ขั้นเจริญเติบโตเต็มที่และตลาดเข้าสู่จุดอิ่มตัว ทําอย่างไรถึงจะรักษาส่วนแบ่งการตลาดไว้ให้นานที่สุด เช่น การจัดงานลดราคาสินค้าเพื่อเป็นการดึงดูดความสนใจลูกค้าจากที่ลูกค้าที่สนใจสินค้าที่ผลิตออกมา กับลูกค้ารายใหม่ที่มีความสนใจเกี่ยวกับสินค้า และเพื่อที่จะรักษาฐานลูกค้าหรือเป็นการเพิ่มฐานลูกค้าให้มากขึ้น",
        });
        break;
      case detailsArr[0].number < -detailsArr[1].number &&
        detailsArr[2].number >= -detailsArr[3].number:
        await this.setState({
          isWO: true,
          data: {
            datasets: [
              {
                data: [{ x: detailsArr[2].number, y: detailsArr[1].number }],
              },
            ],
          },
          mode:
            "หากธุรกิจหรือกิจการของท่านอยู่ในช่วง WO ซึ่งก็คือ Question จะสามารถบอกได้ว่า ธุรกิจหรือกิจการของท่านกำลังอยู่ในช่วงกำลังแข่งขัน ธุรกิจของท่านมีจุดอ่อนทำให้คู่แข่งสามารถใช้จุดอ่อนนั้น โจมตีเราได้ แต่ธุรกิจของเรา ยังสามารถเจริญเติบโตต่อไปได้ โดยเราต้องหาโอกาสโดยรอบทั้งทางตรงและทางอ้อม เพื่อช่วยให้ธุรกิจและกิจการของเราสามารถสู้กับคู่แข่งได้ เช่น ปรับปรุงผลิตภัณฑ์ หรือ ผลิตสินค้าตัวใหม่ออกมา เพื่อสร้างจุดเด่นและดึงดูดลูกค้า ทั้งฐานลูกค้าเดิม และ ลูกค้าใหม่ๆให้เข้ามา",
        });
        break;

      case detailsArr[0].number < -detailsArr[1].number &&
        detailsArr[2].number < -detailsArr[3].number:
        await this.setState({
          isWT: true,
          data: {
            datasets: [
              {
                data: [{ x: detailsArr[3].number, y: detailsArr[1].number }],
              },
            ],
          },
          mode:
            "หากธุรกิจหรือกิจการของท่านอยู่ในช่วงที่ผลิตภัณฑ์มีอัตราการเจริญเติบโตของยอดขายที่น่าเป็นห่วงมากที่สุด และสามารถทำกำไรได้ต่ำ ซึ่งก็คือ Dog  ซึ่งควรแก่การพิจารณาแผนการผลิตโดยเลือกตัดสินใจว่าจะผลิตผลิตภัณฑ์นี้ต่อไปหรือตัดผลิตภัณฑ์นี้ออกจากสายการผลิต พิจารณาปรับปรุงแก้ไขภายในองค์กร พิจารณาเป้าหมายในอนาคต และการแก้ไขปัญหาการเจริญเติบโตของยอดขายให้ดีขึ้น",
        });
        break;
      default:
    }
    console.log(this.state);
    let finalOLC = JSON.parse(localStorage.getItem("finalScoreOLC"));
    switch (swotResultPage) {
      case 1: // ธุรกิจผลิต
        // console.log("1ค้าบ")
        await this.setState({ businessResult: "ธุรกิจผลิต" });
        switch (true) {
          case this.state.isSO:
            await this.setState({ categoryResult: "SO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result1SO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 1 SO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result1SO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 1 SO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result1SO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 1 SO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result1SO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 1 SO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result1SO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 1 SO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isST:
            await this.setState({ categoryResult: "ST" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result1ST[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 1 ST + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result1ST[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 1 ST + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result1ST[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 1 ST + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result1ST[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 1 ST + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result1ST[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 1 ST + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWO:
            await this.setState({ categoryResult: "WO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result1WO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 1 WO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result1WO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 1 WO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result1WO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 1 WO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result1WO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 1 WO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result1WO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 1 WO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWT:
            await this.setState({ categoryResult: "WT" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result1WT[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 1 WT + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result1WT[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 1 WT + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result1WT[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 1 WT + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result1WT[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 1 WT + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result1WT[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 1 WT + OLC5 ค้าบ");
                break;
            }
            break;
          default:
        }
        break;
      case 2: // ธุรกิจบริการ
        await this.setState({ businessResult: "ธุรกิจบริการ" });
        switch (true) {
          case this.state.isSO:
            await this.setState({ categoryResult: "SO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result2SO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 2 SO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result2SO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 2 SO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result2SO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 2 SO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result2SO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 2 SO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result2SO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 2 SO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isST:
            await this.setState({ categoryResult: "ST" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result2ST[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 2 ST + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result2ST[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 2 ST + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result2ST[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 2 ST + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result2ST[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 2 ST + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result2ST[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 2 ST + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWO:
            await this.setState({ categoryResult: "WO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result2WO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 2 WO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result2WO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 2 WO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result2WO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 2 WO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result2WO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 2 WO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result2WO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 2 WO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWT:
            await this.setState({ categoryResult: "WT" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result2WT[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 2 WT + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result2WT[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 2 WT + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result2WT[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 2 WT + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result2WT[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 2 WT + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result2WT[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 2 WT + OLC5 ค้าบ");
                break;
            }
            break;
          default:
        }
        break;
      case 3: // ธุรกิจพาณิชย์
        await this.setState({ businessResult: "ธุรกิจการค้า" });
        switch (true) {
          case this.state.isSO:
            await this.setState({ categoryResult: "SO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result3SO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 3 SO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result3SO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 3 SO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result3SO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 3 SO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result3SO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 3 SO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result3SO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 3 SO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isST:
            await this.setState({ categoryResult: "ST" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result3ST[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 3 ST + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result3ST[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 3 ST + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result3ST[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 3 ST + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result3ST[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 3 ST + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result3ST[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 3 ST + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWO:
            await this.setState({ categoryResult: "WO" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result3WO[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 3 WO + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result3WO[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 3 WO + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result3WO[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 3 WO + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result3WO[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 3 WO + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result3WO[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 3 WO + OLC5 ค้าบ");
                break;
            }
            break;
          case this.state.isWT:
            await this.setState({ categoryResult: "WT" });
            switch (finalOLC[0].phrase) {
              case "OLC1":
                await this.setState({
                  finalResult: this.state.result3WT[0],
                  olcPhraseResult: "OLC ช่วงที่ 1",
                });
                console.log("ธุรกิจ 3 WT + OLC1 ค้าบ");
                break;
              case "OLC2":
                await this.setState({
                  finalResult: this.state.result3WT[1],
                  olcPhraseResult: "OLC ช่วงที่ 2",
                });
                console.log("ธุรกิจ 3 WT + OLC2 ค้าบ");
                break;
              case "OLC3":
                await this.setState({
                  finalResult: this.state.result3WT[2],
                  olcPhraseResult: "OLC ช่วงที่ 3",
                });
                console.log("ธุรกิจ 3 WT + OLC3 ค้าบ");
                break;
              case "OLC4":
                await this.setState({
                  finalResult: this.state.result3WT[3],
                  olcPhraseResult: "OLC ช่วงที่ 4",
                });
                console.log("ธุรกิจ 3 WT + OLC4 ค้าบ");
                break;
              case "OLC5":
                await this.setState({
                  finalResult: this.state.result3WT[4],
                  olcPhraseResult: "OLC ช่วงที่ 5",
                });
                console.log("ธุรกิจ 3 WT + OLC5 ค้าบ");
                break;
            }
            break;
          default:
        }
        break;
    }
  };

  // Render elements
  render() {
    let { btnActive } = this.state;
    return (
      <div style={{ fontFamily: "bold" }}>
        <Navbar swot={btnActive} />
        <div style={{ width: "100%", textAlign: "center", marginTop: "5%" }}>
          <h1
            style={{
              fontFamily: "medium",
              color: "#363c54",
              fontSize: "1.5em",
            }}
          >
            ผลลัพธ์การประเมิน SWOT และ OLC ของ {this.state.businessResult}
          </h1>
          <br />
          <h1
            style={{
              fontFamily: "medium",
              color: "#f16f20",
              fontSize: "1.5em",
            }}
          >
            ผลลัพธ์ธุรกิจของคุณคือ {this.state.categoryResult} ใน{" "}
            {this.state.olcPhraseResult}
          </h1>
        </div>
        <div
          style={{
            padding: "5%",
            display: "flex",
            justifyContent: "center",
            marginTop: "2%",
          }}
        >
          <div
            className="graph-swot"
            style={{
              padding: "5%",
              borderRadius: "8px",
              boxShadow: "0px 4px 10px rgba(94, 92, 92, 0.336)",
            }}
          >
            <div style={{ display: "flex" }}>
              <div
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  flex: "0 0 50%",
                }}
              >
                <p>ST</p>
              </div>
              <div
                style={{
                  display: "flex",
                  justifyContent: "flex-end",
                  flex: "0 0 50%",
                }}
              >
                <p>SO</p>
              </div>
            </div>
            <Bubble data={this.state.data} options={options} />

            <div style={{ display: "flex" }}>
              <div
                style={{
                  display: "flex",
                  justifyContent: "flex-start",
                  flex: "0 0 50%",
                }}
              >
                <p>WT</p>
              </div>
              <div
                style={{
                  display: "flex",
                  justifyContent: "flex-end",
                  flex: "0 0 50%",
                }}
              >
                <p>WO</p>
              </div>
            </div>
          </div>
        </div>

        {/* แสดงไว้ใต้กราฟ */}
        <p
          style={{
            marginLeft: "5%",
            marginRight: "5%",
            fontFamily: "exlight",
            color: "#f16f20",
            fontSize: "1.2em",
            textAlign: "left",
          }}
        >
          {this.state.finalResult}
        </p>

        <div className="home-button" style={{ padding: "5%" }}>
          <div className="buttons">
            <button
              className="button-swot "
              id="button-swot"
              onClick={() => {
                this.props.history.push("/swot-info");
                window.scrollTo(0, 0);
              }}
            >
              แบบประเมิน SWOT
            </button>
            <button
              className="button-olc"
              id="button-olc"
              onClick={() => {
                this.props.history.push("/olc-info");
                window.scrollTo(0, 0);
              }}
            >
              แบบประเมิน OLC
            </button>
            <button
              className="button-both"
              id="button-both"
              onClick={() => {
                this.props.history.push("/pre-swotolc");
                window.scrollTo(0, 0);
              }}
            >
              แบบประเมิน SWOT และ OLC
            </button>
          </div>
        </div>
        <Footer />
      </div>
    );
  }
}
