import React, { Component } from "react";
import Navbar from "../components/navbar";
import Footer from "../components/footer";
import "../../stylesheets/pages/swotInfoPage.css";  

export default class swotInfoPage extends Component {
    constructor(props) {
        super(props);
        // State
        this.state = {
            btnActive: 2,
            expandedText: false
        }
    }

    // Before render
    componentDidMount = async () => {
        localStorage.clear()
    }
    expandedText = async() => {
        await this.setState({ expandedText: true })

    }
    
    // Render elements
    render() {
        let { btnActive } = this.state;
        return (
            <div>
                <Navbar swot={btnActive} />
                <div className="linkback">
                    <p onClick={() => { this.props.history.push("/"); window.scrollTo(0, 0); }}> HOME >{" "}
                        <span style={{ color: "#f16f20" }} onClick={() => { this.props.history.push("/swot-result"); window.scrollTo(0, 0); }}>SWOT</span>
                    </p>
                </div>
                <div className="whole">
                    <div className="swot-infobox">
                        <h1>การวิเคราะห์ SWOT คืออะไร?</h1>
                        <p>Swot Analysis คือ หลักทฤษฎีการวิเคราะห์ชนิดหนึ่งที่มักใช้วิเคราะห์สถานะขององค์กร หรือธุรกิจ โดยการวิเคราะห์ด้วยวิธีการทำ SWOT
                            จะนำเอาจุดแข็งและจุดอ่อนขององค์กร รวมถึงโอกาสและอุปสรรค เข้ามาใช้พิจารณา และวิเคราะห์สถานะภาพของกิจการ เพื่อประโยชน์ในการใช้วางแผนงาน
                            ตลอดจนการสร้างกลยุทธ์ต่างๆ ในการดำเนินธุรกิจหรือดำเนินกิจการองค์กรให้ได้อย่างมีประสิทธิภาพ และเหมาะสมกับสภาพความเป็นจริงขององค์กรอย่างที่สุด
                        </p>
                        <br/>
                        <p> จุดแข็ง (Strengths) :{" "}
                            <span style={{ color: "#363C54" }}>
                                ข้อได้เปรียบของกิจการ หมายถึงลักษณะพิเศษหรือลักษณะเด่นขององค์กรที่เอื้อต่อการประสบความสำเร็จ สามารถนำมาใช้ประโยชน์
                                และใช้แข่งขันกับคู่แข็งได้ ยกตัวอย่างเช่น ความสามารถเฉพาะทางของผู้ประกอบในการดำเนินธุรกิจ ความสามารถในการนำนวัตกรรมมา
                                ใช้ในการดำเนินกิจการ การทำงานร่วมกันเป็นอย่างดีของบุคลากรภายในองค์กร การมีความสัมพันธ์ที่ดีหรือมีพาร์ทเนอร์ที่ช่วยสนับสนุนการดำเนินกิจการขององค์กร
                                ธุรกิจที่ทำลงทุนน้อยและคืนทุนเร็ว <a style={{ color: "#f16f20" , display: this.state.expandedText ? 'none' : 'inline'}} onClick={this.expandedText} className="links">อ่านเพิ่มเติม...</a>
                            </span>{" "}
                            {this.state.expandedText &&
                                <div>
                                    <span style={{ color: "#363C54" }}>
                                        <br />
                                        ตัวอย่างเช่น
                                        <br />– โรงแรมตั้งอยู่ใกล้แหล่งท่องเที่ยวหลายแห่ง
                                        <br />– เนื่องจากโรงแรมเป็นธุรกิจในครอบครัว
                                        จึงมีค่าใช้จ่ายในการจ้างงานน้อยกว่าโรงแรมคู่แข่ง
                                        <br />– เจ้าของโรงแรมมีประสบการณ์ในการบริหารโรงแรมมาก่อน
                                        <br />– กิจการมี Partner ในอุตสาหกรรมการท่องเที่ยวหลายแห่งเช่น
                                        ร้านอาหาร บริการทัวร์ท่องเที่ยว
                                        ทำให้ผู้ใช้บริการที่พักกับโรงแรมได้รับส่วนลด
                                        และสิทธิประโยชน์ต่างๆ
                                    </span>
                                    <br />
                                    <br />
                                    จุดอ่อน (Weaknesses) :{" "}
                                    <span style={{ color: "#363C54" }}>
                                        ข้อด้อย ข้อเสีย หรือปัญหาภายในองค์กร
                                        ที่ส่งผลกระทบต่อการดำเนินกิจการ
                                        ที่สามารถนำไปสู่ความล้มเหลวของการทำธุรกิจได้ ยกตัวอย่างเช่น
                                        ปัญหาด้านการสื่อสารของบุคลากรภายในองค์กร
                                        การใช้โปรแกรมคอมพิวเตอร์ที่ไม่มีลิขสิทธิ์
                                        ค่าเช่าที่ในการดำเนินกิจการมีราคาสูง อัตราดอกเบี้ยกู้ยืมสูง
                                        <br />
                                        <br />
                                        ตัวอย่างเช่น
                                        <br />– มีพนักงานให้บริการและอำนวยความสะดวกจำนวนน้อย
                                        <br />– ห้องพักมีลักษณะเดียวไม่มีความหลากหลาย
                                        <br />– การจองห้องพักไม่สามารถทำได้ผ่านระบบออนไลน์
                                    </span>
                                    <br />
                                    <br />
                                    โอกาส (Opportunity) :{" "}
                                    <span style={{ color: "#363C54" }}>
                                        เกิดจากปัจจัยภายนอก
                                        ที่เป็นปัจจัยที่ส่งผลกระทบในแง่ของการเอื้อประโยชน์ให้กับการดำเนินกิจการของบริษัท
                                        โอกาสต่างจากจุดแข็งตรงที่
                                        เป็นปัจจัยที่เกิดจากภายนอกองค์กรแต่ส่งผลในทางที่ดีกับองค์กร
                                        เป็นความได้เปรียบที่เอื้อต่อความสำเร็จของการดำเนินกิจการ
                                        ยกตัวอย่างเช่น
                                        รัฐบาลออกนโยบายที่สนับสนุนอุตสาหกรรมที่กิจการกำลังดำเนินธุรกิจอยู่
                                        เศรษฐกิจที่อยู่ในช่วงขาขึ้น หรือการมีเทคโนโลยี หรือนวัตกรรมใหม่ๆ
                                        ที่ช่วยให้การดำเนินกิจการเป็นไปได้อย่างเต็มประสิทธิภาพมากขึ้น
                                        <br /> <br />
                                        ตัวอย่างเช่น
                                        <br />
                                        – นโยบายภาครัฐที่ส่งเสริมการท่องเที่ยวแก่ชาวต่างชาติ เช่น
                                        การยกเลิกวีซ่าให้กับนักท่องเที่ยวบางประเทศ
                                        <br /> – นโยบายส่งเสริมการท่องเที่ยวในประเทศให้กับคนไทย เช่น
                                        การนำค่าใช้จ่ายในการ ท่องเที่ยวเมืองหลักมาหักลดหย่อนภาษีเงินได้
                                        <br />– มีแหล่งท่องเที่ยวแห่งใหม่เปิดให้บริการในจังหวัด
                                    </span>
                                    <br />
                                    <br />
                                    อุปสรรค (Threats) :
                                    <span style={{ color: "#363C54" }}>
                                        {" "}
                                        ความเสียเปรียบ หรือผลเสียจากปัจจัยภายนอกที่ส่งผลกระทบต่อกิจการ
                                        อาจนำมาซึ่งปัญหา และความล้มเหลวของกิจการได้ เช่น
                                        เศรษฐกิจที่กำลังตกต่ำ
                                        ราคาน้ำมันที่สูงขึ้นทำให้ต้นทุนในการดำเนินงานเพิ่มขึ้น
                                        การเพิ่มค่าแรงของแรงงาน หรือ
                                        นโยบายอัตราดอกเบี้ยที่ถูกปรับให้สูงขึ้น <br />
                                        <br />
                                        ตัวอย่างเช่น
                                        <br />– เศรษฐกิจอยู่ในช่วงขาลง
                                        ทำให้คนมีเงินใช้จ่ายในการท่องเที่ยวน้อยลง
                                        <br />– นักท่องเที่ยวเปลี่ยนรูปแบบการเดินทาง
                                        เป็นการท่องเที่ยวเชิงวัฒนธรรม
                                        นิยมการเข้าพักในรูปแบบของโฮมสเตย์มากขึ้น
                                        <br />– ข่าวเรื่องมลภาวะทางอากาศ
                                        ทำให้นักท่องเที่ยวที่เดินทางไปจังหวัดเชียงใหม่ลดน้อยลง
                                    </span>
                                </div>
                            }
                            <br />
                            <br />
                            คู่มือการทำ Swot Analysis
                            <span style={{ color: "#363C54" }}>
                                <br/><br/>1. เมื่อเข้าสู้หน้าของเครื่องมือแล้ว จะพบกับหน้าแรกให้เลือกประเภทของธุรกิจของธุรกิจของท่าน
                                <br/><br/>2. เมื่อเลือกประเภทธุรกิจของท่านแล้วหน้าเว็บจะไปที่หน้าถัดไป คือการเริ่มต้นการทำ Swot Analysis โดยท่านเลือกจุดแข็ง จุดอ่อน โอกาส และอุปสรรคของธุรกิจท่านมากที่สุด เมื่อเลือกครบปัจจัยแรกโปรแกรมจะเลื่อนลงไปให้ท่านเลือกปัจจัยถัดไปจนครบทุกปัจจัย ให้ท่านกดปุ่ม Next เพื่อไปประเมินในขั้นตอนถัดไป
                                <br/><br/>3. เมื่อเข้าสู่หน้าถัดไปท่านจะพบกับปัจจัยอย่างอย่างละ 5 ข้อ เพื่อให้ท่านให้คะแนนแต่ละปัจจัย โดยการให้คะแนนแต่ละปัจจัยนั้นจะมีการกำหนดค่าคะแนนให้ 1 – 5 โดยเรียงจากกส่งผลกระทบน้อยไปมาก การให้คะแนนแต่ละปัจจัยต้องเป้นความจริงจากธุรกิจของท่าน เพื่อความถูกต้องในการวิเคราะห์ธุรกิจของท่าน เมื่อท่านให้คะแนนครบทุกปัจจัยแล้ว โปรแกรมจะประมวลผลและได้รับผลประเมินออกมาให้ถัดกดปุ่ม Next เพื่อดำเนินการต่อไป
                                <br/><br/>4. เมื่อท่านได้รับผลประเมินของแต่ละปัจจัยออกมา โปรแกรมจะทำผลประเมินมาวาดกราฟลงใน BCG Matrix และให้คำแนะนำสำหรับธุรกิจของท่าน
                            </span>
                        </p>
            <button
              className="button"
              onClick={() => {
                this.props.history.push("/pre-swot");
                window.scrollTo(0, 0);
              }}
            >
              <span>เริ่มการวิเคราะห์</span>
            </button>
          </div>
        </div>
        <Footer className="footer" />
      </div>
    );
  }
}
