import React, { Component } from "react";
import Navbar from "../components/navbar";
import Footer from "../components/footer";
import "../../stylesheets/pages/swotInfoPage.css";
import { withRouter } from "react-router-dom";

class swotolcInfo extends Component {
  constructor(props) {
    super(props);
    // State
    this.state = {
      btnActive: 4,
      expandedText1: false,
      expandedText2: false,
    };
  }

  // Before render
  componentDidMount = async () => {
    localStorage.clear();
    localStorage.setItem("swotolcBoolean", false);
  };

  expandedText1 = async () => {
    await this.setState({ expandedText1: true });
  };

  expandedText2 = async () => {
    await this.setState({ expandedText2: true });
  };

  // Render elements
  render() {
    let { btnActive } = this.state;
    return (
      <div>
        <Navbar swot={btnActive} />
        <div className="linkback">
          <p
            onClick={() => {
              this.props.history.push("/");
              window.scrollTo(0, 0);
            }}
          >
            {" "}
            HOME > <span style={{ color: "#f16f20" }}>SWOT & OLC</span>
          </p>
        </div>
        <div className="whole">
          <div className="swot-infobox">
            <h1>SWOT และ OLC คืออะไร?</h1>
            <p>
              Swot Analysis คือ
              หลักทฤษฎีการวิเคราะห์ชนิดหนึ่งที่มักใช้วิเคราะห์สถานะขององค์กร
              หรือธุรกิจ โดยการวิเคราะห์ด้วยวิธีการทำ SWOT
              จะนำเอาจุดแข็งและจุดอ่อนขององค์กร รวมถึงโอกาสและอุปสรรค
              เข้ามาใช้พิจารณา และวิเคราะห์สถานะภาพของกิจการ
              เพื่อประโยชน์ในการใช้วางแผนงาน ตลอดจนการสร้างกลยุทธ์ต่างๆ
              ในการดำเนินธุรกิจหรือดำเนินกิจการองค์กรให้ได้อย่างมีประสิทธิภาพ
              และเหมาะสมกับสภาพความเป็นจริงขององค์กรอย่างที่สุด
            </p>
            <br />
            <p>
              {" "}
              จุดแข็ง (Strengths) :{" "}
              <span style={{ color: "#363C54" }}>
                ข้อได้เปรียบของกิจการ
                หมายถึงลักษณะพิเศษหรือลักษณะเด่นขององค์กรที่เอื้อต่อการประสบความสำเร็จ
                สามารถนำมาใช้ประโยชน์ และใช้แข่งขันกับคู่แข็งได้ ยกตัวอย่างเช่น
                ความสามารถเฉพาะทางของผู้ประกอบในการดำเนินธุรกิจ
                ความสามารถในการนำนวัตกรรมมา ใช้ในการดำเนินกิจการ
                การทำงานร่วมกันเป็นอย่างดีของบุคลากรภายในองค์กร
                การมีความสัมพันธ์ที่ดีหรือมีพาร์ทเนอร์ที่ช่วยสนับสนุนการดำเนินกิจการขององค์กร
                ธุรกิจที่ทำลงทุนน้อยและคืนทุนเร็ว{" "}
                <a
                  style={{
                    color: "#f16f20",
                    display: this.state.expandedText1 ? "none" : "inline",
                  }}
                  onClick={this.expandedText1}
                  className="links"
                >
                  อ่านเพิ่มเติม...
                </a>
              </span>{" "}
              {this.state.expandedText1 && (
                <div>
                  <span style={{ color: "#363C54" }}>
                    <br />
                    ตัวอย่างเช่น
                    <br />– โรงแรมตั้งอยู่ใกล้แหล่งท่องเที่ยวหลายแห่ง
                    <br />– เนื่องจากโรงแรมเป็นธุรกิจในครอบครัว
                    จึงมีค่าใช้จ่ายในการจ้างงานน้อยกว่าโรงแรมคู่แข่ง
                    <br />– เจ้าของโรงแรมมีประสบการณ์ในการบริหารโรงแรมมาก่อน
                    <br />– กิจการมี Partner
                    ในอุตสาหกรรมการท่องเที่ยวหลายแห่งเช่น ร้านอาหาร
                    บริการทัวร์ท่องเที่ยว
                    ทำให้ผู้ใช้บริการที่พักกับโรงแรมได้รับส่วนลด
                    และสิทธิประโยชน์ต่างๆ
                  </span>
                  <br />
                  <br />
                  จุดอ่อน (Weaknesses) :{" "}
                  <span style={{ color: "#363C54" }}>
                    ข้อด้อย ข้อเสีย หรือปัญหาภายในองค์กร
                    ที่ส่งผลกระทบต่อการดำเนินกิจการ
                    ที่สามารถนำไปสู่ความล้มเหลวของการทำธุรกิจได้ ยกตัวอย่างเช่น
                    ปัญหาด้านการสื่อสารของบุคลากรภายในองค์กร
                    การใช้โปรแกรมคอมพิวเตอร์ที่ไม่มีลิขสิทธิ์
                    ค่าเช่าที่ในการดำเนินกิจการมีราคาสูง อัตราดอกเบี้ยกู้ยืมสูง
                    <br />
                    <br />
                    ตัวอย่างเช่น
                    <br />– มีพนักงานให้บริการและอำนวยความสะดวกจำนวนน้อย
                    <br />– ห้องพักมีลักษณะเดียวไม่มีความหลากหลาย
                    <br />– การจองห้องพักไม่สามารถทำได้ผ่านระบบออนไลน์
                  </span>
                  <br />
                  <br />
                  โอกาส (Opportunity) :{" "}
                  <span style={{ color: "#363C54" }}>
                    เกิดจากปัจจัยภายนอก
                    ที่เป็นปัจจัยที่ส่งผลกระทบในแง่ของการเอื้อประโยชน์ให้กับการดำเนินกิจการของบริษัท
                    โอกาสต่างจากจุดแข็งตรงที่
                    เป็นปัจจัยที่เกิดจากภายนอกองค์กรแต่ส่งผลในทางที่ดีกับองค์กร
                    เป็นความได้เปรียบที่เอื้อต่อความสำเร็จของการดำเนินกิจการ
                    ยกตัวอย่างเช่น
                    รัฐบาลออกนโยบายที่สนับสนุนอุตสาหกรรมที่กิจการกำลังดำเนินธุรกิจอยู่
                    เศรษฐกิจที่อยู่ในช่วงขาขึ้น หรือการมีเทคโนโลยี
                    หรือนวัตกรรมใหม่ๆ
                    ที่ช่วยให้การดำเนินกิจการเป็นไปได้อย่างเต็มประสิทธิภาพมากขึ้น
                    <br /> <br />
                    ตัวอย่างเช่น
                    <br />
                    – นโยบายภาครัฐที่ส่งเสริมการท่องเที่ยวแก่ชาวต่างชาติ เช่น
                    การยกเลิกวีซ่าให้กับนักท่องเที่ยวบางประเทศ
                    <br /> – นโยบายส่งเสริมการท่องเที่ยวในประเทศให้กับคนไทย เช่น
                    การนำค่าใช้จ่ายในการ
                    ท่องเที่ยวเมืองหลักมาหักลดหย่อนภาษีเงินได้
                    <br />– มีแหล่งท่องเที่ยวแห่งใหม่เปิดให้บริการในจังหวัด
                  </span>
                  <br />
                  <br />
                  อุปสรรค (Threats) :
                  <span style={{ color: "#363C54" }}>
                    {" "}
                    ความเสียเปรียบ
                    หรือผลเสียจากปัจจัยภายนอกที่ส่งผลกระทบต่อกิจการ
                    อาจนำมาซึ่งปัญหา และความล้มเหลวของกิจการได้ เช่น
                    เศรษฐกิจที่กำลังตกต่ำ
                    ราคาน้ำมันที่สูงขึ้นทำให้ต้นทุนในการดำเนินงานเพิ่มขึ้น
                    การเพิ่มค่าแรงของแรงงาน หรือ
                    นโยบายอัตราดอกเบี้ยที่ถูกปรับให้สูงขึ้น <br />
                    <br />
                    ตัวอย่างเช่น
                    <br />– เศรษฐกิจอยู่ในช่วงขาลง
                    ทำให้คนมีเงินใช้จ่ายในการท่องเที่ยวน้อยลง
                    <br />– นักท่องเที่ยวเปลี่ยนรูปแบบการเดินทาง
                    เป็นการท่องเที่ยวเชิงวัฒนธรรม
                    นิยมการเข้าพักในรูปแบบของโฮมสเตย์มากขึ้น
                    <br />– ข่าวเรื่องมลภาวะทางอากาศ
                    ทำให้นักท่องเที่ยวที่เดินทางไปจังหวัดเชียงใหม่ลดน้อยลง
                  </span>
                </div>
              )}
              <br />
              <br />
            </p>
            <p>
              OLC (Organization life cycle) หรือวงจรชีวิตขององค์กร คือ
              เครื่องมือหรือสิ่งที่ใช้ในการวิเคราะห์ธุรกิจหรือกิจการว่าองค์กรหรือกระบวนต่างๆ
              ไม่ว่าจะเป็นการทำงานหรือการบริหารงานในกิจการของคุณนั้นอยู่ในช่วงใด
              เมื่อทราบว่าอยู่ในช่วงใดนั้น คุณจะสามารถหาวิธีรับมือ
              วิธีการแก้ไขปัญหาหรือแนวทางในการดำเนินกิจการสืบต่อไป ซึ่ง OLC
              มีทั้งหมด 5 ขั้นได้แก่
            </p>
            <br />
            <p>
              1. ระยะก่อตั้ง (Birth) / ขั้นแนะนำ (Introduction) :{" "}
              <span style={{ color: "#363C54" }}>
                เป็นช่วงที่องค์กรหรือธุรกิจของท่านเริ่มก่อตั้งขึ้น
                โดยองค์กรอาจจะยังไม่ใหญ่โตมาก
                การทำงานในองค์กรนั้นต้องสามารถผลัดเปลี่ยนหรือหมุนเวียนงานกันทำได้
                ผู้บริหารหรือเจ้าของกิจการอาจจะต้องลงมาทำงานด้วยเช่นกัน
                ระยะนี้ถือว่าอยู่ในช่วงที่อ่อนแอ
                ถ้าหากคู่แข่งล่วงรู้ว่าธุรกิจหรือองค์กรของเราพึ่งจัดตั้งขึ้น
                และเราไม่มีกลยุทธ์ป้องกันอาจทำให้คู่แข่งสามารถโจมตีเราได้ง่าย
                ในระยะนี้จะต้องประคับประคองธุรกิจให้องค์กรสามารถอยู่รอด
                เพื่อให้สามารถก้าวไปในขั้นต่อไปหรือระยะต่อไปได้
              </span>{" "}
              <a
                style={{
                  color: "#f16f20",
                  display: this.state.expandedText2 ? "none" : "inline",
                }}
                onClick={this.expandedText2}
                className="links"
              >
                อ่านเพิ่มเติม...
              </a>
              {this.state.expandedText2 && (
                <div>
                  <br />
                  2. ระยะเติบโต (Growth) :{" "}
                  <span style={{ color: "#363C54" }}>
                    องค์กรเริ่มมีความเข้มแข็งขึ้นและเริ่มเลี้ยงตนเองได้
                    มีการขยายกำลังคนและมีกำลังที่จะก้าวไปข้างหน้าด้วยการขยายฐานลูกค้า
                    มีผลิตภัณฑ์หรือบริการใหม่ๆออกสู่ตลาด
                    ระยะนี้จะเห็นผลกำไรมากกว่าระยะแรก
                    รูปแบบขององค์การมีลักษณะเป็นทางการมากขึ้น
                    ไม่ว่าจะเป็นในเรื่องของการติดต่อสื่อสาร
                    มีลำดับขั้นของสายบังคับบัญชา นโยบาย
                    แผนการทำงานและวิสัยทัศน์ที่ชัดเจน
                    ดังนั้นกิจการควรใช้โอกาสนี้ในการขยายฐานลูกค้า
                    โดยทำการตลาดให้ธุรกิจหรือแบรนด์เป็นที่รู้จักมากขึ้น
                    หรือหากต้องการขยายขนาดธุรกิจสามารถทำได้ในช่วงนี้
                  </span>
                  <br />
                  <br />
                  3. ระยะวุฒิภาวะ / ระยะเติบโตเต็มที่ (Maturity) :{" "}
                  <span style={{ color: "#363C54" }}>
                    ระยะนี้ถ้าเทียบกับอายุคนจะถือว่าอยู่ในวัยผู้ใหญ่
                    เพราะเป็นช่วงที่องค์การเติบโตเต็มที่หรือมีอัตราการเจริญเติบโตช้าลง
                    แต่สามารถแบ่งส่วนครองตลาดได้มากกว่าระยะอื่นๆ
                    ซึ่งจะมีค่าใช้จ่ายในการดูแลรักษาลูกค้าหรือค่าใช้จ่ายในการรักษาฐานลูกค้าสูง
                    ต้นทุนก็จะเพิ่มขึ้นในขณะที่ยอดขายเท่าเดิม
                    อาจทำให้กำไรของธุรกิจลดลง
                    ถ้าหากไม่มีการพัฒนาอาจจะทำให้องค์กรมีโอกาสตายได้
                    ดังนั้นองค์กรต้องมองหาทางเลือกหรือโอกาสใหม่ๆ
                    มีการพัฒนาอยู่ตลอดเวลา
                    โดยการนำกลยุทธ์มาใช้เพื่อให้ลูกค้าจงรักภักดีต่อแบรนด์ เช่น
                    ช้างมีการแจกผ้าห่มหรือเป็นสปอนเซอร์ให้กับนักฟุตบอล
                    เพื่อรักษาภาพลักษณ์ที่ดีและกลุ่มลูกค้า เป็นต้น
                  </span>
                  <br />
                  <br />
                  4. ระยะเสื่อมถอย / ระยะตกต่ำ (Decline) :
                  <span style={{ color: "#363C54" }}>
                    {" "}
                    เป็นระยะที่องค์การหรือธุรกิจกำลังประสบปัญหาต่างๆ เช่น
                    พนักงานมีการลาออกเพิ่มขึ้น สินค้าและบริการมียอดขายลดลง
                    พนักงานปฏิบัติตามคำสั่งเพียงอย่างเดียวโดยไม่มีความคิดเห็นหรือไม่มีความคิดสร้างสรรค์เป็นของตนเอง
                    สาเหตุเกิดมาจากความเบื่อหน่ายในการปฏิบัติงาน
                    วิธีการแก้ไขปัญหาก็คือ ต้องใช้กลยุทธ์หรือแรงจูงใจในการทำงาน
                    เช่น จัดกิจกรรมพิเศษ เพิ่มโบนัส เพิ่มเงินเดือน เป็นต้น{" "}
                  </span>
                  <br />
                  <br />
                  5. การยุบองค์กร / การสิ้นสุดสภาพขององค์กร (Death) :
                  <span style={{ color: "#363C54" }}>
                    {" "}
                    เมื่อมีการเสื่อมถอยขององค์การมากขึ้น คือ ยอดขายลดลงเรื่อยๆ
                    คนงานลาออกมากขึ้น จนถึงจุดที่ไม่สามารถทนต่อปัญหาต่างๆได้
                    ซึ่งอาจสังเกตได้จาก กิจการไม่มีกำไร ขาดทุน
                    ผู้รับบริการหรือผู้บริโภคไม่ตอบสนอง
                    ซึ่งดูได้จากการที่จัดโปรโมชั่นหรือลด แลก แจก แถม
                    แต่ผู้บริโภคไม่สนใจ จนทำให้กิจการไม่สามารถดำเนินต่อไปได้
                    ในช่วงนี้กิจการสามารถดำเนินต่อไปได้
                    แต่จะมีต้นทุนหรือค่าใช้จ่ายที่สูงมาก
                    เหมือนเป็นการเริ่มต้นกิจการใหม่ ในการทำธุรกิจนั้น
                    กิจการไม่ควรปล่อยให้ธุรกิจของตนเองดำเนินมาจนถึงขั้นที่ 5 นี้
                    เพราะมีโอกาสที่จะปิดกิจการสูงมาก น้อยที่จะกลับไปเริ่มต้นใหม่
                    ส่วนใหญ่ผู้ประกอบการหรือผู้ที่ทำธุรกิจจะไม่ปล่อยให้ธุรกิจของตนเองก้าวไปถึงขั้นที่
                    3 เมื่ออยู่ขั้นที่ 2 ก็จะทำการพัฒนาเพื่อไม่ให้ธุรกิจถดถอย{" "}
                  </span>
                </div>
              )}
              <br />
              <br />
              คู่มือการทำ SWOT Analysis + Organization Life Cycle (OLC)
              <br />
              <br />
              <span style={{ color: "#363C54" }}>
                1. เมื่อเข้าสู้หน้าของเครื่องมือแล้ว
                จะพบกับหน้าแรกให้เลือกประเภทของธุรกิจของธุรกิจของท่าน <br />
                <br />
                2. เมื่อเลือกประเภทธุรกิจของท่านแล้วหน้าเว็บจะไปที่หน้าถัดไป
                คือการเริ่มต้นการทำ Swot Analysis โดยท่านเลือกจุดแข็ง จุดอ่อน
                โอกาส และอุปสรรคของธุรกิจท่านมากที่สุด
                เมื่อเลือกครบปัจจัยแรกโปรแกรมจะเลื่อนลงไปให้ท่านเลือกปัจจัยถัดไปจนครบทุกปัจจัย
                ให้ท่านกดปุ่ม Next เพื่อไปประเมินในขั้นตอนถัดไป
                <br />
                <br /> 3. เมื่อเข้าสู่หน้าถัดไปท่านจะพบกับปัจจัยอย่างอย่างละ 5
                ข้อ เพื่อให้ท่านให้คะแนนแต่ละปัจจัย
                โดยการให้คะแนนแต่ละปัจจัยนั้นจะมีการกำหนดค่าคะแนนให้ 1 – 5
                โดยเรียงจากกส่งผลกระทบน้อยไปมาก
                การให้คะแนนแต่ละปัจจัยต้องเป้นความจริงจากธุรกิจของท่าน
                เพื่อความถูกต้องในการวิเคราะห์ธุรกิจของท่าน
                เมื่อท่านให้คะแนนครบทุกปัจจัยแล้ว
                โปรแกรมจะประมวลผลและได้รับผลประเมินออกมาให้ถัดกดปุ่ม Next
                เพื่อดำเนินการต่อไป
                <br />
                <br />
                4. เมื่อทำการกด Next แล้ว
                ในหน้าถัดไปจะเป็นในส่วนของการทำแบบทดสอบ OLC
                <br />
                <br />
                5. ให้ผู้ใช้งานเลือกคำตอบที่ตรงกับธุรกิจตนเองมากที่สุดไม่เกิน 10
                ตัวเลือก เมื่อทำการเลือกเสร็จสิ้นแล้วให้กดที่ปุ่ม ประเมินผล
                <br />
                <br />
                6. เมื่อทำการเลือกเสร็จสิ้นระบบจะทำการประเมินผลลัพธ์ที่ได้
                หากท่านได้รับผลประเมินของแต่ละปัจจัยออกมา
                โปรแกรมจะนำผลการประเมินที่ได้มาวาดกราฟลงใน BCG Matrix
                และวิเคราะห์ว่าธุรกิจหรือกิจการของท่านนั้นอยู่ในช่วงใดของวงจรชีวิตธุรกิจ
                (OLC) พร้อมคำแนะนำสำหรับธุรกิจของท่าน
                <br />
                <br />
              </span>
              **หมายเหตุ
              <br />- ข้อมูลที่ได้อาจเป็นข้อมูลเพียงเบื้องต้นเท่านั้น
              <br />- ตัวเลือกที่ใช้ในการทำแบบทดสอบนั้นอยู่ในช่วงระยะเวลา
              <br />
              ปัจจุบัน (เดือนพฤษภาคม พ.ศ.2563)
              <br />- ในกรณีที่ทำแบบทดสอบเสร็จสิ้นแล้วไม่ปรากฏคำตอบ
              หากแต่แสดงหน้าเว็บไซต์ที่เป็นแบบสอบถามอีกครั้ง
              ให้ท่านเลือกคำตอบที่ตรงกับธุรกิจของท่านไม่เกิน 5 ตัวเลือก
              และทำการกดประเมินผลอีกครั้ง
              <br />
            </p>
            <button
              className="button"
              onClick={() => {
                this.props.history.push("/pre-swotolc");
                window.scrollTo(0, 0);
              }}
            >
              <span>เริ่มการวิเคราะห์</span>
            </button>
          </div>
        </div>
        <Footer className="footer" />
      </div>
    );
  }
}

export default withRouter(swotolcInfo);
